{"owner":{"reputation":230,"user_id":337980,"user_type":"registered","profile_image":"https://i.stack.imgur.com/mpaEJ.jpg?s=128&g=1","display_name":"Anton Menshov","link":"https://ru.meta.stackoverflow.com/users/337980/anton-menshov"},"score":7,"last_edit_date":1579260500,"last_activity_date":1579260500,"creation_date":1579259230,"post_type":"answer","post_id":10034,"link":"https://ru.meta.stackoverflow.com/a/10034","body":"<p>Я получил следующее сообщение от модераторов (в частности – Николая, что в письме не указано, но правки делал он, и информация о правках публичная):</p>\n\n<blockquote>\n  <p>Антон, добрый день!</p>\n  \n  <p>Спешу сообщить, что я внес изменения в ваш вопрос на Мете: Можно ли\n  настроить время нахождения сообщения об уходе модератора в блоке\n  «важное на Мете» на Stack Overflow на русском?</p>\n  \n  <p>Я понимаю, что у вас есть много мыслей и чувств по поводу указанного\n  вами решения. С другой стороны, на Stack Overflow существуют\n  определенные правила о том как должен выглядеть вопрос. В двух словах:\n  максимально минимально, но достаточно для ответа. Пожалуйста,\n  постарайтесь в будущем не включать в вопрос то, что к нему не\n  относится напрямую (например, личную оценку), ведь это никак не\n  помогает разобраться в ситуации.</p>\n  \n  <p>С уважением, команда модераторов сайта «Stack Overflow на русском»</p>\n</blockquote>\n\n<p>На что я ответил:</p>\n\n<blockquote>\n  <p>Я <strong>в корне и категорично</strong> не согласен с вашим решением, но в войну правок вступать не собираюсь. Я думаю нет никакого смысла мне вам обосновывать мое несогласие – вы и сами все знаете.</p>\n</blockquote>\n\n<p>В дальнейшем я тщательно перефразировал свой вопрос с целью удовлетворить требования (хотя я и не до конца понимаю зачем).</p>\n\n<p>Остальное наше общение насчет корректности правок, правоприменения редактирования с резким изменением стиля и конкретных вещей в вопросах и начало \"войн правок\" проходило в:</p>\n\n<ul>\n<li><a href=\"https://ru.meta.stackoverflow.com/q/10028/337980\">комментариях к вышеупомянутому вопросу</a> (публично доступно)</li>\n<li><a href=\"https://chat.stackexchange.com/transcript/message/53257396#53257396\">в чате StackOverflow на русском</a> (публично доступно, мало)</li>\n<li>в Teacher's Lounge (приватный канал, доступно только модераторам)</li>\n</ul>\n\n<p>К сожалению, ответы Николая меня не удовлетворили и многие аспекты освещены не были. Я выразил благодарность Николаю за попытки разъяснения, и прекратил дискуссию. Не по причине своей удовлетворенности, а лишь с целью экономии времени обоих нас, ибо дискуссия была контрпродуктивна, во всяком случае для меня.</p>\n\n<p>Я надеюсь Николай ответит на вопрос Qwertiy здесь, так как мои проблемы - это мои проблемы, а данный конкретный вопрос важен с точки зрения установление прецедента для модерирования и интересует уже модераторов.</p>\n\n<p>NB: Я выложил сообщение модератора в публичный доступ так как согласно моему пониманию имею на это право, ибо это разглашает только мои персональные данные и претензии модератора (CM) лично ко мне. </p>\n\n<p>NB2: Считаю эту информацию важной для <strong>частичного</strong> ответа на поставленный вопрос и представления полной картины, ибо цитату сообщения модератора имею право выложить в публичный доступ лишь я.</p>\n"}