{"owner":{"reputation":124333,"user_id":195342,"user_type":"registered","accept_rate":12,"profile_image":"https://i.stack.imgur.com/8hsxs.jpg?s=128&g=1","display_name":"Harry","link":"https://ru.meta.stackoverflow.com/users/195342/harry"},"score":19,"last_edit_date":1579687714,"last_activity_date":1579687714,"creation_date":1579330047,"post_type":"answer","post_id":10036,"link":"https://ru.meta.stackoverflow.com/a/10036","body":"<p>Само собой, мое чисто субъективное мнение.</p>\n\n<p>Результатом эксперимента стало закрытие вопросов с едва ли не первой попавшейся под мышку причиной. Потому что писать свой текст в \"Другое\" не у каждого хватает терпения.</p>\n\n<p>Количество ответов на такие вопросы немного увеличилось - что в результате не дает потом никаких оснований для чистки: есть вопрос, есть принятый ответ - что еще нужно?</p>\n\n<p>Меня лично эти вопросы беспокоят не как вопросы от лентяев сами по себе - они связаны с резким снижением уровня ruSO. Когда человек приходит с вопросом \"как вызвать функцию?\" - это уже предельная лень и нежелание учиться. Задекларированной <strong>пользы для сообщества</strong> от такого вопроса - ноль.</p>\n\n<p>Поэтому я бы скорее вернул причину не только \"учебные задания\", но и добавил бы </p>\n\n<blockquote>\n  <p>Вопрос вызван проблемой, которая больше не воспроизводится, опечаткой или незнанием азов.</p>\n</blockquote>\n\n<p>С рекомендацией сообществу - не давать ответ, но в комментариях подтолкнуть в нужную сторону (комментария обычно достаточно, чтобы ответить на такой вопрос). Так что такие вопросы благополучно закрывались бы, при этом вопрошающий получал бы толчок (зачастую большой шаг вперед является результатом хорошего пинка в зад) в нужном направлении, и не терял бы возможность добиться чего-то своим трудом и получить удовольствие от самостоятельного понимания :)</p>\n\n<p>Но, вообще говоря, что-то мне слабо верится, что наши доводы - а их в пользу возврата, как мне кажется, больше, чем против - к чему-то приведут :(</p>\n"}