{"owner":{"reputation":10625,"user_id":177188,"user_type":"registered","accept_rate":36,"profile_image":"https://i.stack.imgur.com/K9VA7.png?s=128&g=1","display_name":"Kromster says support Monica","link":"https://ru.meta.stackoverflow.com/users/177188/kromster-says-support-monica"},"score":1,"last_activity_date":1579756071,"creation_date":1579756071,"post_type":"answer","post_id":10048,"link":"https://ru.meta.stackoverflow.com/a/10048","body":"<p><strong>Это оффтопик для основного сайта ruSO и иногда онтопик для Меты.</strong></p>\n\n<p>В двух словах - цель SO это создание базы прикладных вопросов и объективных ответов:</p>\n\n<blockquote>\n  <p>Stack Overflow на русском — это сайт вопросов и ответов для профессиональных разработчиков программного обеспечения, энтузиастов программирования и системных администраторов. Сайт создан и управляется сообществом. С вами вместе мы создаём свободную библиотеку подробных ответов на любой прикладной вопрос по программированию и системному администрированию.</p>\n</blockquote>\n\n<p>Что такое опрос - это удовлетворение любопытства на счет какой-либо темы (кто что любит, яблоки или апельсины, табы или пробелы, xml или json?). Практической пользы от результата - мало. Зная результат, нам, как специалистам, <strong>все равно нужно знать и понимать причины</strong> такого распределения голосов, чтобы сделать свой какой-либо информированный выбор. Узнать сильные и слабые стороны вариантов, чтобы выбрать тот что нам нужен.</p>\n\n<p>Да, иногда, нам может быть нужно оценить объемы использования какой-либо технологии, чтобы выбрать ту, по которой больше специалистов и чаще и лучше дадут ответ. Но это делается не опросом, а изучением статистики.</p>\n\n<p>Также, многие темы опросов, почва для флейма и конфликтов - какая компания лучше, чей движок мощнее, и т.п.</p>\n\n<p>Таким образом, <strong>стоит переформулировать свой вопрос из \"опроса\" в \"вопрос\"</strong>. То есть определить что именно вас интересует с прикладной точки зрения, и спросить об этом.</p>\n\n<p>Касательно вашего примера, его не обязательно приводить в виде опроса. Это вполне может быть обычным вопросом \"В чем разница/преимущества между А и Б?\", и если у вариантов действительно есть различия, то вы о них узнаете.</p>\n\n<hr>\n\n<p>На Мете опросы относительно работы сайта разрешены, если они преследуют не праздное любопытство, а имеют каку-либо практическую цель, т.к. они помогают нам определить консенсус относительно чего-либо (разрешать ли код-ревью, например). Если сообщество решительно настроено по какой-либо теме и это явно не противоречит основным правилам, то второстепенные и негласные правила вполне могут быть изменены или дополнены.</p>\n"}