---
title: "Post 12166"
se.owner.user_id: 517922
se.owner.display_name: "Andrew Cool"
se.owner.link: "https://ru.meta.stackoverflow.com/users/517922/andrew-cool"
se.link: "https://ru.meta.stackoverflow.com/q/12166"
se.post_id: 12166
se.post_type: question
---
<p>Итак, вот сама задача:
&quot;Пифагоровы тройки&quot;
Напишите программу, которая находит тройки натуральных чисел a,b,c таких, что a⩽b⩽c⩽n и a^2+b^2=c^2.</p>
<p>Заметьте, что таким образом, вы найдёте все прямоугольные треугольники с целочисленными сторонами.</p>
<p>Формат входных данных
В первой строке содержится целое число n (1⩽n⩽103).</p>
<p>Формат результата
Выведите тройки a,b,c в лексикографическом порядке.</p>
<p>Пример:
Входные Данные:</p>
<p>15</p>
<p>Результат:</p>
<p>3 4 5</p>
<p>5 12 13</p>
<p>6 8 10</p>
<p>9 12 15</p>
<p>Вот мой код:</p>
<pre><code>def pif_triples(n):
    tmp = [k * k for k in range(1, n + 1)]
    res = []
    for i in range(1, n):
        for j in range(i, n):
            q = tmp[i] + tmp[j]
            if q in tmp:
                k = tmp.index(q)
                res.append((i, j, k + 1))
    return res


n = int(input())
for a in pif_triples(n):
    print(*a)
</code></pre>
<p>и при вводе 15, он выводит
2 3 5</p>
<p>4 11 13</p>
<p>5 7 10</p>
<p>8 11 15</p>
<p>Что делать, как поменять?</p>
