{"owner":{"reputation":10148,"user_id":277611,"user_type":"registered","profile_image":"https://i.stack.imgur.com/RAZJK.jpg?s=128&g=1","display_name":"AR Hovsepyan","link":"https://ru.meta.stackoverflow.com/users/277611/ar-hovsepyan"},"score":5,"last_edit_date":1575109493,"last_activity_date":1575109493,"creation_date":1575109109,"post_type":"answer","post_id":9810,"link":"https://ru.meta.stackoverflow.com/a/9810","body":"<blockquote>\n  <p>Мы верим, что и авторы вопросов, и отвечающие — важные части нашей\n  экосистемы.</p>\n</blockquote>\n\n<p>Вера тут непричем, это есть факт, я бы сказал, что они явлются единственными составляющими, привлекающим пользователей. Может быть для некоторых пользователей и очень важна репутация, но я не понимаю почему задающий вопрос вообше должен ожидать какие то  улучшения в репутации. Лично для меня, как задающего вопрос, важно:</p>\n\n<ol>\n<li>Решить свою проблему, или</li>\n<li>Поделиться интересующим мне вопросом с другими пользовательями, или </li>\n<li>Узнать что то новое, узнать мнение профи по данному вопросу, или, даже, может</li>\n<li>Поднять активность вопросов на сайте в некотором низкоактивном\n    промежутке, просто придумывая вопрос...</li>\n</ol>\n\n<p>Я лишь хочу сказать, что задающий вопрос уже имеет некоторую обьективную или субьективную выгоду. По положительным или отрицательным отзывам, он (другой участник) может оценить качество своего вопроса, и тем самым эти отзывы являются дополнительной помощью помимо ответов и комментарий.</p>\n\n<p>Вознаграждение за вопрос в качестве репутаций, мне думается, нужно давать только тем, чей вопрос имеет несколько положительных отзывов(например начиная с пяти плюсов). Может быть количество  репутаций в таком случаи стоит и увеличить до <code>20</code> за каждый последующий голос, но суть в том, что вопрос, получивший много плюсов, является ценным вопросом как для сайта, так и для пользователей. Нынче получается, что начинающий задал 10 вопросов, ответы на которых знает каждый программист и хороший студент, и десять начинающих посчитали ваш вопрос полезным, в сумме получаете <code>100</code> баллов репутации, а человек, задающий один вопрос, действительно полезный для многих пользователей, может даже не набрать столько репутации. И хотя, для себя я не считаю репутацию стимулом для своего участия, но, думаю, еще раз нужно подумать по поводу данной темы обсуждения...</p>\n\n<hr>\n\n<p>Что касается отвечающим, то они проделывают гораздо больше работу, чем задающие, их гораздо меньше, и к ним требования гораздо больше, потому что  качество ответа  намного важнее качества вопроса, и отвечающим, чаще(но не всегда так), нужно иметь гораздо больше\nинформации или опыта. Я понимаю, когда школьникам интересна набранная репутация.. Не думаю, что это важна для профи со стажем, но всеравно важно правильная политика вознаграждений. <strong>Надеюсь,  многие понимают, что главным результатом ответов и вопросов является рост наших знаний, культуры общения и подачи информации.</strong>  Я также надеюсь, что многие понимают, что далеко не всегда отвечающий обладает большими знаниями по отношению к задающему, поэтому нет тут никаких <code>учеников и учителей</code>,  а есть пользователи, имеющими затруднения и пользователи, знающие ответ на данный вопрос. Никто не может знать и помнить или замечать все...</p>\n"}