{"owner":{"reputation":2063,"user_id":189027,"user_type":"registered","profile_image":"https://lh4.googleusercontent.com/-pkEy9i31AfM/AAAAAAAAAAI/AAAAAAAAAXo/oenRa9YNUFo/photo.jpg?sz=128","display_name":"Михаил Ребров","link":"https://ru.meta.stackoverflow.com/users/189027/%d0%9c%d0%b8%d1%85%d0%b0%d0%b8%d0%bb-%d0%a0%d0%b5%d0%b1%d1%80%d0%be%d0%b2"},"score":1,"last_edit_date":1576707565,"last_activity_date":1576707565,"creation_date":1576707245,"post_type":"answer","post_id":9890,"link":"https://ru.meta.stackoverflow.com/a/9890","body":"<blockquote>\n  <p>Хотите ли вы написать книгу? </p>\n</blockquote>\n\n<p>Делиться своим опытом я определенно хочу и более того: я постоянно это практикую.<br/>\nНо вряд ли это имело бы формат книги...</p>\n\n<blockquote>\n  <p>О чём она могла бы быть?</p>\n</blockquote>\n\n<p>Если бы я писал книгу, то она посвящалась бы не техническим аспектам, а IT-бизнесу и менеджменту.<br/></p>\n\n<p>Найти информацию по техническим аспектам и разобраться с этим не так то уж и сложно.<br/>\nС этим в России нет никаких проблем.<br/>\nМы одна из ведущих стран, по поставкам мяса в мировую IT-индустрию.<br/></p>\n\n<p>А вот менеджмент в России это полное дно.<br/>\nИ IT-бизнес в России это дикий запад.<br/></p>\n\n<p>Плюс данный опыт является и самым болезненным и эмоциональным.<br/>\nПоэтому и мотивация делиться данным опытом является наибольшей.</p>\n\n<blockquote>\n  <p>Что вам мешает, какие сложности вас наиболее пугают?</p>\n</blockquote>\n\n<p>Мешает только время... точнее его постоянная нехватка или полное отсутствие.</p>\n\n<blockquote>\n  <p>Почему, по вашему мнению, написание книг не распространено в России?</p>\n</blockquote>\n\n<p>Написание книг в России очень даже распространено...одна только Дарья Данцова сколько книг написала? <br/>\nЕсли же говорить о технической литературе, то тут есть несколько проблем:</p>\n\n<ul>\n<li>№ 1. Русскоязычное IT-коммьюнити не такое уж и большое, чтобы окупилось время на написание книги с нуля. Работая тоже время программистом, как правило, заработаешь больше. Исключение может составить php какой-нибудь... Если же речь идет о каких-то более высоких материях, то увы и ах... На них не такой большой спрос.</li>\n<li>№ 2. Русскоязычное коммьюнити вторично по своей сути... все продукты, инструменты и пр. выпускаются как правило в мировое сообщество. А языком общения в данном мировом сообществе является - английский. Соответственно первичная документация, туториалы и прочая сопровождающая литература оригинально выпускаются на английском. И тебе нужно время на то чтобы освоить данный продукт и инструмент изучить всю документацию, туториалы, кейсы и прочие материалы на английском языке. Потом написать что-то оригинальное, но уже на русском... Пока ты ее закончишь выйдет уже новая версия, а возможно даже не одна...и все твои труды будут уже неактуальны... В далеком 2007 году я был таким же наивным и переводил документации к популярным программным продуктам/фреймворкам с английского на русский... еще тогда я понял всю бессмысленность этой затеи... Ты тратишь на это драгоценные килотонны своего времени, а воспользуются твоими трудами 2 калеки... и то в лучшем случае. Обидно делать работу, которую никто не видит и которая никому не нужна.</li>\n</ul>\n\n<blockquote>\n  <p>Как можно улучшить положение вещей по данному вопросу?</p>\n</blockquote>\n\n<p>Положение вещей не является каким-то \"не таким\".<br/>\nВсе в порядке своих вещей. <br/>\nЛюди делятся своими знаниями и опытом.<br/>\nПросто в 2К19 году для этой цели подходят не только книги.<br/>\nЕсть блоги, сообщества, хабр, стековерфлоу, форумы, youtube, конференции и прочее.<br/><br/>\nИ нам грех жаловаться... я не видел никакой другой профессиональной отрасли с такой активностью в плане обмена опытом.<br/>\nИ с каждым годом активность только увеличивается.<br/>\nДругое дело, что процент книг в данной деятельности всё уменьшается, но так и в общем, книги в плане распространения контента и информации уже давно уступили пальмы первенства журналам, телевидению и интернету... \nТак что в этом нет ничего сверхестественного.</p>\n"}