{"owner":{"reputation":30228,"user_id":15479,"user_type":"moderator","accept_rate":51,"profile_image":"https://i.stack.imgur.com/hEsjL.png?s=128&g=1","display_name":"Suvitruf says Reinstate Monica","link":"https://ru.meta.stackoverflow.com/users/15479/suvitruf-says-reinstate-monica"},"score":20,"last_edit_date":1576956202,"last_activity_date":1576956202,"creation_date":1576955818,"post_type":"answer","post_id":9910,"link":"https://ru.meta.stackoverflow.com/a/9910","body":"<p>Основных требований то не так уж и много:</p>\n\n<ul>\n<li>Не использовать оскорбления.</li>\n<li>Не использовать символику, очевидно оскорбляющую кого-нибудь. Был у нас тут один персонаж, который специально провоцировал людей картинками рейха.</li>\n</ul>\n\n<p>По поводу же коммунистической символики...Я довольно лоялен в этом плане. Сам лично принимать какие-то меры не буду, т.к. довольно спокойно отношусь к сарказму и иронии. </p>\n\n<p>Проблема с тревогами в том, что мы обязаны реагировать на них. Если кого-то аватарка обидит, то мы будем вынуждены какие-то меры принять. Сложность тут в том, что мы исходим из позиции \"хороших намерений\", т.е. когда человек жалуется, подразумевается, что он не троллит и т.п. И вот когда люди пользуются этой лазейкой и троллят тревогами, вот такие случаи сложно разруливать.</p>\n\n<p>В общем, если резюмировать:</p>\n\n<ul>\n<li>Если аватарка никого не оскорбляет, то можно использовать.</li>\n<li>Политические взгляды через аватарку? Опять же, если там нет оскорблений.</li>\n<li>Если кто-то пожалуется, то мы будем как-то решать вопрос. Нет, бана не будет. В худшем случае мы попросим сменить аватар.</li>\n<li>В вашем случае проблема в том, как вы поставили вопрос. Мне видится это так, будто вы хотите поставить такую аватарку назло, своего рода провокация. Само это не нарушает правила (хотя вразрез идёт с политикой be nice), но если будут жалобы, то этот нюанс сыграет не в вашу пользу.</li>\n</ul>\n\n<p><strong>P.S.</strong> в России символика коммунизма/СССР и т.п. в принципе не запрещена. Просто аватарка с Лениным, к примеру, или серп+молот - это уж точно правил не нарушает.</p>\n"}