{"owner":{"reputation":52978,"user_id":28748,"user_type":"registered","profile_image":"https://i.stack.imgur.com/LgbNe.jpg?s=128&g=1","display_name":"Alexandr_TT","link":"https://ru.meta.stackoverflow.com/users/28748/alexandr-tt"},"score":11,"last_edit_date":1577996231,"last_activity_date":1577996231,"creation_date":1577794393,"post_type":"answer","post_id":9948,"link":"https://ru.meta.stackoverflow.com/a/9948","body":"<h2>Поздравляю всех, всех, всех с наступающим Новым 2020 годом!</h2>\n\n<p>В прошлом году, также под Новый 2019 год была интересная тема рассказывать о людях, с которыми познакомились в прошедшем году, чьи работы были интересны и полезны лично для ТС. Хочу поддержать традицию и немного написать о людях, которые приятно поразили меня в уходящем 2019 году.   </p>\n\n<p><strong>Кому интересна эта тема, расскажите о своих коллегах, может дополните ссылками  их работ.</strong></p>\n\n<p><a href=\"https://i.stack.imgur.com/KvrJw.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/KvrJw.png\" alt=\"введите сюда описание изображения\"></a>    </p>\n\n<p>Не смотрите на его стаж в профиле, это была спящая учетная запись.<br>\n Stranger активно начал действовать только в этом году и набрал рекордное количество репы <strong>40к</strong> за год!    </p>\n\n<p>Но запомнился он прежде всего своими яркими, оригинальными ответами. Общее количество, опять же за год перевалило за <code>1100</code><br>\n Я уверен,  многие помнят его <a href=\"https://ru.stackoverflow.com/a/927012/28748\"> первую оригинальную  работу</a> на Новогоднем конкурсе 2019 года.<br>\n С ним хорошо рядом отвечать в топике, на его бренд-имя люди летят как бабочки на огонь, но плохо участвовать с ним в одном конкурсе, так как победить его практически невозможно :=) </p>\n\n<p><a href=\"https://i.stack.imgur.com/Zz1jK.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/Zz1jK.png\" alt=\"введите сюда описание изображения\"></a></p>\n\n<p>Я до сих пор жалею, что Павел очень редко появляется и отвечает. Всего 47 ответов. Но посмотрите, какие они яркие и полезные.  <a href=\"https://ru.stackoverflow.com/a/825600/28748\">Как создать эффект Воды?</a>   </p>\n\n<p>Павел ушёл, но обещал вернуться. Буду ждать его возвращения с нетерпением.  </p>\n\n<p><a href=\"https://i.stack.imgur.com/I2E29.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/I2E29.png\" alt=\"введите сюда описание изображения\"></a>     </p>\n\n<p>Та же история, как с Павлом. Ярко блистал ответами и бросил активную деятельность. </p>\n\n<p>Вот один из них: <a href=\"https://ru.stackoverflow.com/a/924052/28748\">Как сделать баннер с капающим краном</a>   </p>\n\n<p>Очень надеюсь, что Юра вернется!   </p>\n\n<p><a href=\"https://i.stack.imgur.com/pkani.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/pkani.png\" alt=\"введите сюда описание изображения\"></a>  </p>\n\n<p>Мы вместе с ним и @Air начали продвигать SVG на ruSO. Открыли <a href=\"https://chat.stackexchange.com/rooms/70612/svg-chat\">Svg_chat</a>, активно общались и попутно изучали SVG.  </p>\n\n<p>Вот одна из его работ:  <a href=\"https://ru.stackoverflow.com/q/803801/28748\">Стилизация и анимация текста SVG</a>  </p>\n\n<p>А это одна, из самых первых его работ: <a href=\"https://ru.stackoverflow.com/a/787491/28748\">Как нарисовать автомобиль с помощью команд SVG</a> </p>\n\n<p><a href=\"https://i.stack.imgur.com/ttCar.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/ttCar.png\" alt=\"введите сюда описание изображения\"></a> </p>\n\n<p>Наша боевая подруга по SVG. Сколько всего было, сколько пройдено.<br>\nУ этой девушки, как вопросы, так и ответы хороши. Она постоянно, что-то новое изучает, внедряет. Всегда с интересом читаю её вопросы и если могу, то отвечаю на них, но не всегда получается, вот такие заковыристые вопросы она задаёт!  :=)    </p>\n\n<p><a href=\"https://ru.stackoverflow.com/a/926581/28748\">Посмотрите её ответ</a> на прошлогоднем конкурсе НГ и этим всё сказано.  </p>\n\n<p><a href=\"https://i.stack.imgur.com/gcGJu.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/gcGJu.png\" alt=\"введите сюда описание изображения\"></a></p>\n\n<p>Его ответы в основном в разделе Javascript. Кто отвечает в этом разделе, как правило, думают, что все хорошо знают JS и поэтому размещают, как минимум или наблюдается полное отсутствие поясняющих комментарий к ответам.  </p>\n\n<p>Ответы @OPTIMUS PRIME, буквально с самых первых постов, пребывания на сайте, приятно удивляли своей основательностью и стремлением донести в подробных пояснениях все нюансы. Бывало, его нещадно критиковали <code>опытные</code> участники за столь подробные объяснения и да, он к сожалению стал меньше комментировать в своих крайних ответах. Могу по дружески посоветовать, - делайте, как Вы сами считаете, правильней и лучше!</p>\n"}