{"owner":{"reputation":53305,"user_id":28748,"user_type":"registered","profile_image":"https://i.stack.imgur.com/LgbNe.jpg?s=128&g=1","display_name":"Alexandr_TT","link":"https://ru.meta.stackoverflow.com/users/28748/alexandr-tt"},"score":3,"last_activity_date":1578634221,"creation_date":1578634221,"post_type":"answer","post_id":9997,"link":"https://ru.meta.stackoverflow.com/a/9997","body":"<blockquote>\n  <p>Я не имею отношения к веб-дизайну и графике, поэтому не собирался\n  участвовать в конкурсе, как и не имею сильной позиции против него. Моя\n  основная претензия к конкурсу, это то, что он слишком расплывчатый,\n  нет определенных условий и критериев победы. Даже и сами формулировки\n  непонятны: </p>\n</blockquote>\n\n<p>Хорошо, давайте поразмыслим немного об жёстких, не расплывчатых условиях проведения конкурса.  </p>\n\n<p>Когда писались  правила проведения обычного конкурса, то подразумевалось, что организатор конкурса, не получив решения в обычных ответах, готов пожертвовать, рискнуть своей репой и открыть конкурс, чтобы привлечь внимание и может быть всё таки получить правильный ответ. Поэтому и требования в вопросе и к решению должны быть очень чёткими.</p>\n\n<p>Вы настаиваете на соблюдении таких правил проведения конкурса.  </p>\n\n<p>Тогда, в этом случае, организатор конкурса должен дать например: </p>\n\n<ol>\n<li><p>Изображение новогодней ёлочки и нельзя использовать другую ёлку</p></li>\n<li><p>Использовать чёткую формулировку, описывающую, допустим анимации огней на ёлке. Они должны бежать сверху-вниз. Анимация звезды, для отвечающего уже оффтопик.</p></li>\n<li><p>Привести код своей попытки, где у него якобы не получилось это сделать.</p></li>\n<li><p>Оговорить 2-3 тега (метки) допустим CSS и JS   </p></li>\n</ol>\n\n<p>Допустим я предпочитаю делать анимации в SVG, значит я уже за бортом конкурса и не приму участие в конкурсе? </p>\n\n<p>А кто-то может захочет сделать анимацию падающих снежинок или анимацию Деда Мороза со снегурочкой, зайчиков там всяких, белочек и других новогодних персонажей? Тоже за бортом конкурса?     </p>\n\n<p>Объединение двух пунктов объектов анимации или тем более уже весь этот далеко не полный список, уже попадает под определение <code>слишком общий вопрос, на который невозможно дать чёткий, однозначный ответ</code></p>\n\n<p>А кто-то хочет блеснуть в анимации фразы <strong>С Новым Годом!</strong>   </p>\n\n<p>У кого-то лучше всего получаются фейерверки, значит тоже за бортом конкурса?</p>\n\n<p>Хорошо, попробуйте провести такой конкурс по чётко оговоренному, не <code>расплывчатому</code> заданию. Не ошибусь сильно, если участников будет от одного до трех и участие будет не ради творчества, а желания срубить репу. Качество будет тоже соответственное, ведь даже в случае непринятия ни одного из ответов система распределит её половину между ответившими участниками. И люди об этом знают :)    </p>\n\n<p>Вы этого хотите? Именно такого проведения Новогоднего конкурса?    </p>\n\n<p><strong>Теперь о чётких критериях победителя</strong>   </p>\n\n<p>Вообще-то негласное правило, - кто платит, тот и заказывает музыку (выбирает ответ)  </p>\n\n<p>Но ни справедливости, ни возмущения насчет неправильного выбора победителя, однако не наблюдалось, ни в конкурсах 2018 года (призы выдавались 4 раза, разными спонсорами ) ни в 2019 году (призы выдавались 2 раза) Так, как были выбраны, действительно самые сильные, самые зрелищные работы.   </p>\n\n<p>Поэтому я считаю, что формулировка, выбранная в этом году для проведения конкурса НГ: </p>\n\n<blockquote>\n  <p>Картинка может быть любая, анимация может быть любой, требование лишь\n  одно, - сюжет и персонажи должны быть Новогодними.    </p>\n</blockquote>\n\n<p>Наиболее подходит к такому конкурсу и позволит проявить  любому участнику свои знания  и полёт фантазии.</p>\n\n<p>Можно порассуждать также, над расширением тегов (меток) больше 5-ти для привлечения бОльшего количества участников, чтобы конкурс НГ действительно стал общим для всех, у кого есть желание и возможности показать свои работы.      </p>\n\n<p>Можно обсудить варианты параллельного проведения нескольких конкурсов НГ по разному набору меток. Но это вряд ли удастся, так как очень трудно раскачать, зажечь большое количество людей по разным меткам.  </p>\n\n<p>Поэтому в 2019 году, как и в 2018 году была включена фраза в условия проведения конкурса: </p>\n\n<blockquote>\n  <p>Кроме тегов включенных в вопрос, допускается использовать ответы с\n  дополнительными тегами.</p>\n</blockquote>\n"}