{"owner":{"reputation":9967,"user_id":215103,"user_type":"registered","profile_image":"https://i.stack.imgur.com/5oQlf.png?s=128&g=1","display_name":"HolyBlackCat","link":"https://ru.meta.stackoverflow.com/users/215103/holyblackcat"},"is_accepted":false,"score":16,"last_activity_date":1579035820,"last_edit_date":1579035820,"creation_date":1579034217,"answer_id":10016,"question_id":10013,"body":"<p>Я считаю, стоит вернуть причину на место.</p>\n\n<p>Когда эту причину закрытия отключали, привели <a href=\"https://ru.meta.stackoverflow.com/questions/9743/\">следующие аргументы</a>:</p>\n\n<blockquote>\n  <ol>\n  <li>Закрываются хорошие вопросы. Если вопрос является \"домашкой\" - это ещё не означает, что вопрос плох. Он всё ещё может быть полезен\n  сообществу.</li>\n  <li>Закрытие с этой причиной некоторых авторов сбивает с толку.</li>\n  <li>Такие вопросы после закрытия попадают в очередь, где требуется участие 5 человек для решения дальнейшей судьбы вопроса</li>\n  </ol>\n</blockquote>\n\n<p>По порядку:</p>\n\n<hr>\n\n<blockquote>\n  <p><em>\"1. Закрываются хорошие вопросы. Если вопрос является \"домашкой\" - это ещё не означает, что вопрос плох. Он всё ещё может быть полезен сообществу.\" — <a href=\"https://ru.meta.stackoverflow.com/questions/9743/\">(c)</a></em></p>\n</blockquote>\n\n<p>Раз количетсво закрытых вопросов не изменилось, значит в этом плане отключение причины не ничего не дало:</p>\n\n<blockquote>\n  <p>Нет больших изменений в общем объёме закрытых вопросов.</p>\n</blockquote>\n\n\n\n<blockquote>\n  <p>Использование других похожих причин увеличилось, поскольку исчезла одна причина.</p>\n</blockquote>\n\n<p>Почему-то ниже написали, что</p>\n\n<blockquote>\n  <p>Не подтвердилось то, что вопросы, которые ранее закрывали как \"домашки\", теперь закрыты по другим причинам. ... Впрочем, и нет свидетельств обратного.</p>\n</blockquote>\n\n<p>Но я с этим совершенно не согласен. Как же \"не подтвердилось\", если количество закрытых вопросов не изменилось? Другие причины стали использовать больше.</p>\n\n<p>Примеры домашки, закрытой с неправильной причиной:\n<strong><a href=\"https://ru.stackoverflow.com/questions/1068617\">1</a>\n<a href=\"https://ru.stackoverflow.com/questions/1069129\">2</a>\n<a href=\"https://ru.stackoverflow.com/questions/1068278\">3</a>\n<a href=\"https://ru.stackoverflow.com/questions/1067887\">4</a>\n<a href=\"https://ru.stackoverflow.com/questions/1067900\">5</a>\n<a href=\"https://ru.stackoverflow.com/questions/1068897\">6</a>\n<a href=\"https://ru.stackoverflow.com/questions/1067463\">7</a>\n<a href=\"https://ru.stackoverflow.com/questions/1067332\">8</a>\n<a href=\"https://ru.stackoverflow.com/questions/1066186\">9</a></strong> - Думаю этого достаточно? Это только за последние 10 дней, только по тегу C++.</p>\n\n<p>Кроме того, я не видел, чтобы этой причиной злоупотребляли. Есть примеры таких незаслуженно закрытых вопросов?</p>\n\n<hr>\n\n<blockquote>\n  <p><em>\"2. Закрытие с этой причиной некоторых авторов сбивает с толку.\" — <a href=\"https://ru.meta.stackoverflow.com/questions/9743/\">(c)</a></em></p>\n</blockquote>\n\n<p>Не понял, при чем тут это. Если текст причины закрытия сбивает с толку (в чем я сомневаюсь, ни разу такого не видел), то нужно исправлять текст причины, а не убирать ее.</p>\n\n<p>Мне кажется, закрытие вопросов про домашку с неправильными причинами, вызванное этим экспериментом, гораздо больше сбивает с толку.</p>\n\n<p>Вот например: <a href=\"https://ru.stackoverflow.com/questions/1069129\">вопрос с домашкой</a> закрыли с неправильной причиной: <em>\"Этот вопрос необходимо уточнить или дополнить подробностями.\"</em></p>\n\n<p>Если бы я был автором этого вопроса, мне было бы совершенно непонятно, чего от меня хочет сообщество. \"дополнить подробностями\" - куда уж подробнее, если в вопросе задание приведено дословно? Еще и заминусили, не объяснив за что. А потом мы удивляемся, что SO критикуют за токсичность.</p>\n\n<p>С другой стороны, в старой причине было понятным языком написано, что мы хотим от автора вопроса:</p>\n\n<blockquote>\n  <p><strong>Учебные задания допустимы в качестве вопросов только при условии, что вы пытались решить их самостоятельно перед тем, как задать вопрос.</strong> Пожалуйста, отредактируйте вопрос и укажите, что именно вызвало у вас трудности при решении задачи. Например, приведите код, который вы написали, пытаясь решить задачу.</p>\n</blockquote>\n\n<p>Это объясняет автору, что ему нужно делать, чтобы его вопросы не закрывали, и объясняет ему причину минсов.</p>\n\n<hr>\n\n<blockquote>\n  <p><em>\"3. Такие вопросы после закрытия попадают в очередь, где требуется участие 5 человек для решения дальнейшей судьбы вопроса\" — <a href=\"https://ru.meta.stackoverflow.com/questions/9743/\">(c)</a></em></p>\n</blockquote>\n\n<p>Раз количество закрываемых вопросов не изменилось, то в этом плане отключение причины ничего не дало.</p>\n\n<hr>\n\n<p>И еще одна причина, почему стоит верунть все как было:</p>\n\n<p>У меня нет доказательств, но мне кажется, что теперь вопросы с домашкой стали закрывать медленее - кто-то стесняется использовать \"неправильную\" причину закрытия.</p>\n\n<p><sup>(@Shog9 этого не измерил, но теперь его уже не спросить. Он <a href=\"https://meta.stackexchange.com/questions/342031/thank-you-shog9\">покинул славные ряды</a> сотрудников SE.)</sup></p>\n\n<p>Это плохо, потому что у людей с приступами альтруизма появляется больше времени, чтобы отвечать на такие вопросы. А если на них будут отвечать, то их авторы будут снова и снова возвращаться к нам со своей домашкой (может быть даже порекомендуют SO друзьям-халявщикам), и качество вопросов на SO будет ухудшаться.</p>\n\n<p>Причина популярности SO (в первую очередь английского SO) - качество накопленного там контента. Он не забит мусорными вопросами. </p>\n"}