{"owner":{"reputation":14528,"user_id":217579,"user_type":"registered","profile_image":"https://i.stack.imgur.com/xUeS7.png?s=128&g=1","display_name":"0xdb","link":"https://ru.meta.stackoverflow.com/users/217579/0xdb"},"is_accepted":false,"score":1,"last_activity_date":1580051430,"last_edit_date":1580051430,"creation_date":1580047906,"answer_id":10058,"question_id":9908,"body":"<p>Нет, явного запрета на определённые аватары в правилах данного сообщества нет.</p>\n\n<p>Если изображение на аватаре не нарушает общепринятых законодательных нормативов по публикации материалов в интернете, т.е. не содержит разжигание рассовой ненависти, призывов к насилию, порнографии и т.п., то его можно здесь использовать.</p>\n\n<blockquote>\n  <p>Можно ли выражать политические взгляды через аватарку?</p>\n</blockquote>\n\n<p>Вопрос более конкретный и явного запрета тоже вроде нет. Только встает вопрос -- а чем вызвано стремление выразить свои политические взгляды именно на данном ресурсе?</p>\n\n<p>Цитата из <a href=\"https://ru.stackoverflow.com/help/key-values\">Ключевые ценности сообщества</a>:</p>\n\n<blockquote>\n  <p>Любое взаимодействие на сайте начинается с взаимного уважения к коллегам, вне зависимости от обстоятельств, репутации, знаний или <strong>чего–либо еще</strong>.</p>\n</blockquote>\n\n<p>Осмелюсь продолжить <strong>чего–либо еще</strong>: принадлежности к политическим или религиозным течениям (или приверженности таковых взглядов), пола, рассы или сексуальной ориентации.       </p>\n\n<p>Будет ли проявлено взаимное уважение к коллегам, размещая аватар с политическим \"окрасом\", политические взгляды которых с вашими не совпадают?</p>\n\n<p>Исходя из вышеизложенного: </p>\n\n<ul>\n<li>Пожалуйста, используйте только нейтральные аватары и цитаты в профиле. При сомнении в нейтральности, пользуйтесь аватарами по умолчанию сгенерированными системой.</li>\n<li>Если заметите у кого-то не совсем \"нейтральный\" аватар, то проигнорируйте, не стоит сразу же устанавливать себе аватар на \"противоположенный\".  </li>\n</ul>\n"}