{"owner":{"reputation":45496,"user_id":6,"user_type":"moderator","accept_rate":10,"profile_image":"https://i.stack.imgur.com/dVTjR.jpg?s=128&g=1","display_name":"Nicolas Chabanovsky","link":"https://ru.meta.stackoverflow.com/users/6/nicolas-chabanovsky"},"is_accepted":false,"score":8,"last_activity_date":1578653223,"creation_date":1578653223,"answer_id":10001,"question_id":9961,"body":"<h3>Конкурсы на Stack Overflow</h3>\n\n<p>У конкурсов в нашем сообществе богатая история: мы проводили различные конкурсы практически с первого дня существования сайта, причем как на Мете, так и на основном сайте, проводили и сами, и в партнерстве с другими сообществами. На наш взгляд, сами по себе конкурсы — это здорово. </p>\n\n<p>Движок и миссия Stack Overflow накладывает свои ограничения на конкурс, об этом стоит помнить при планировании. Например, на основном сайте, конкурсный вопрос не должен выходить за рамки правил сайта и механик движка. На мой взгляд, запустить конкурс правильно совершенно не сложно, главное — было бы желание! Если вы хотите провести конкурс и считаете, что вам нужна какая-либо помощь, пожалуйста, напишите <a href=\"https://ru.stackoverflow.com/users/6/nicolas-chabanovsky?tab=profile\">мне</a> или <a href=\"https://ru.stackoverflow.com/users?tab=moderators\">модераторам</a> об этом! Мы обязательно поможем оформить конкурс (а в некоторых случаях поможем с памятными призами победителям).</p>\n\n<h3>«Новогодний конкурс узаконен»</h3>\n\n<p>В публикации «<a href=\"https://ru.meta.stackoverflow.com/q/7420/6\">Теория модерации</a>» рассказано про устройство Stack Overflow:</p>\n\n<ul>\n<li>Все участники модерируют сайт. Привилегии модерации зависят от текущей репутации участника.</li>\n<li>В случае исключительных ситуаций модерации, участникам ассистируют модераторы.</li>\n<li>При необходимости, исключительные ситуации рассматриваются на Мете.</li>\n</ul>\n\n<p>Формулировка «Новогодний конкурс узаконен» — досадное стечение обстоятельств. Модераторы единолично по дизайну сайта не создают «законы» и не могут чего–либо «узаконивать». Участники обсуждают вопросы модерации вместе, в том числе вопрос <a href=\"/help/on-topic\">тематики сайта</a>, а при необходимости, в обсуждениях принимают участие сотрудники компании (управляющие сообществами). <a href=\"https://ru.meta.stackoverflow.com/a/7425/6\">Я писал про это детально в ранее.</a></p>\n\n<p>На мой взгляд, этот вопрос следует читать примерно так:</p>\n\n<blockquote>\n  <p>Здравствуйте, дорогие коллеги! Поздравляем вас с Новым Годом! Чтобы скоротать вечера длинных выходных, пожалуйста, примите участие в новогоднем конкурсе! Изобретательность и нестандартный подход к решению — хорошая заявка на победу! Будем рады вашим ответам =)</p>\n</blockquote>\n"}