{"owner":{"reputation":91025,"user_id":178988,"user_type":"moderator","accept_rate":59,"profile_image":"https://www.gravatar.com/avatar/cbfaff96665b7567defe1b34a883db8b?s=128&d=identicon&r=PG","display_name":"Qwertiy","link":"https://ru.meta.stackoverflow.com/users/178988/qwertiy"},"is_accepted":false,"score":8,"last_activity_date":1575054572,"last_edit_date":1575054572,"creation_date":1575051821,"answer_id":9802,"question_id":9800,"body":"<ol>\n<li>На ответе стояла тревога \"Невежливый или оскорбительный\".</li>\n<li>Информация о том, кто по твоему мнению минусует сообщение, ответом никак являться не может. В комментариях ещё ладно, но точно не в ответе.</li>\n<li>Маркеры <code>UPD 1</code> ... <code>UPD N</code>, очевидно, полезной информации не приносят. Это ответ, а не чат.</li>\n<li>Я перенёс некоторые куски, которые мне было жалко удалять вместе с жалобами на минусаторов, и постарался придать им связный вид.</li>\n<li>В остальном я стилистику не менял, только поудалял лишнее.</li>\n<li>Это ответ и его вполне можно править дальше, если что-то из исправлений не устраивает.</li>\n<li>Информация о том, что ответ принят, не означает того, что он правильный. Автор вопроса всего лишь один человек, который таким образом выражает своё мнение. К тому же, он в любой момент может передумать и переставить галочку на любой другой ответ.</li>\n<li>А ещё, в данном вопросе очевидно, что автор совершенно не является экспертом в данной теме, поэтому выставлять его мнение как единственно верное, вообще странно.</li>\n</ol>\n\n<blockquote>\n  <p>Ну и что? Кому-то показалось что-то оскорбительным?</p>\n</blockquote>\n\n<p>Я удалил то, что не относилось к вопросу. Я даже в комментарии не писал про удаление оскорблений. Но вообще-то и формулировки вполне можно было почистить.</p>\n\n<blockquote>\n  <p>Почему мне нельзя в ответе прокомментировать необъяснимую волну минусов?</p>\n</blockquote>\n\n<p>Потому что ответ - это ответ на заданный вопрос. В вопросе нет ничего про минусы, вопрос только про cmake. И даже в этом предложении ты используешь слово <em>\"прокомментировать\"</em> - это надо делать в комментариях, а не в ответах.</p>\n\n<blockquote>\n  <p>Маркеры UPD 1 ... UPD N играют важную роль, они показывают развитие диалога.</p>\n</blockquote>\n\n<p>Ответ - это не диалог. Для диалогов есть чат. В крайнем случае комментарии. Ответы же нужны для ответов на вопросы.</p>\n\n<blockquote>\n  <p>И да, зачем Вы удалили смайлы? Смайлы что, тоже под запретом на stackoverflow?</p>\n</blockquote>\n\n<p>Я не вижу, где бы я удалял смайлы. Единственное предложение со смайлом, которое я трогал, не удалено, а перенесено в конец. И во всём абзаце только незначительные правки орфографии. Просто сайт почему-то сравнивает не с тем абзацем и получается как будто изменилось всё. Я уже об этом <a href=\"https://ru.meta.stackoverflow.com/q/9803/178988\">вопрос сам задал</a>. Впрочем, сомневаюсь, что кто-то будет это править, по крайней мере в ближайшее время.</p>\n\n<p><a href=\"https://i.stack.imgur.com/IrKLI.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/IrKLI.png\" alt=\"скриншот\"></a></p>\n\n<blockquote>\n  <p>Участники задают дополнительные вопросы в комментариях.</p>\n</blockquote>\n\n<p>Тогда их вопрос можно процитировать в ответе и ответить на него. Добавления нового фрагмента в вопрос вполне достаточно, помечать его номером не требуется. А при удалении кусков ответа, некоторые из которых являются целыми апдеййтами, вообще какая-то фигня получится с нумерацией, так что логично её удалить заодно.</p>\n\n<p>К тому же, вопрос \"Почему и кто минусует ответ?\" не является дополнительным к вопросом в обсуждении cmake. И его даже никто не задавал.</p>\n\n<blockquote>\n  <p>Почему из вопроса и из заголовка стерли ник модератора Qwertiy♦?</p>\n</blockquote>\n\n<p>А это не я. Я только ссылку на обсуждаемый ответ добавил и номер ревизии в нём.</p>\n"}