{"owner":{"reputation":2412,"user_id":282637,"user_type":"registered","profile_image":"https://i.stack.imgur.com/rX1ss.png?s=128&g=1","display_name":"Ver Nick says Reinstate Monica","link":"https://ru.meta.stackoverflow.com/users/282637/ver-nick-says-reinstate-monica"},"is_accepted":true,"score":10,"last_activity_date":1577356711,"last_edit_date":1577356711,"creation_date":1577308293,"answer_id":9929,"question_id":9920,"body":"<p>Перевод топового ответа от Script47 (<a href=\"https://meta.stackexchange.com/a/340913/403480\">источник</a>):</p>\n\n<hr>\n\n<p>Может быть, жесткая критика, но я верю, что честная и справедливая.</p>\n\n<p>Ваш пост звучит так, как будто ваши адвокаты подготовили его для вас.\nВ тексте  отсутствует человечность, есть только рафинированный канцелярский язык.</p>\n\n<blockquote>\n  <p>Stack Overflow и Моника Челлио пришли к соглашению. <strong>Мы верим, что\n  г-жа Челлио не имела злого умысла. Мы считаем, что она не поняла всех\n  нюансов, а также дух и смысл нашего Code of Conduct (кодекса\n  поведения), и неправильно поняла, к чему он обязывает и что\n  запрещает.</strong></p>\n</blockquote>\n\n<p>Мы уже установили это. Что не было установлено, так это то, почему ее просьбы о разъяснениях были проигнорированы с такой силой.</p>\n\n<blockquote>\n  <p>Мы признаём, что наши ответы на её просьбы о разъяснениях были\n  неудовлетворительными. Формулировки нашего Code of Conduct, касающиеся\n  того, что именно ожидается от пользователей, были недостаточно точны.\n  <strong>Мы всегда ценили вклад г-жи Челлио в сообщество и уважали её ум, честность и её профессиональные навыки писателя.</strong></p>\n</blockquote>\n\n<p>Неужели? Тогда бы вы поступили с ней любезно, ответив раньше, и не стали бы ждать, пока потребуются адвокаты. Вы бы относились к ней немного с достоинством и порядочностью, не разговаривая с прессой.</p>\n\n<blockquote>\n  <p>Хотя в нашем первоначальном заявлении мы не говорили конкретно о ней,\n  мы сожалеем, что упомянули её имя, когда отвечали на вопросы\n  репортера. <strong>Мы сожалеем о любом уроне, нанесённом репутации г-жи\n  Cellio, и о любом другом ущербе, который она могла понести.</strong></p>\n</blockquote>\n\n<p>Сказал адвокат...</p>\n\n<blockquote>\n  <p>С тех пор мы обновили некоторые наши политики и процессы, чтобы\n  гарантировать, что впредь мы будем более осторожны в наших публичных\n  заявлениях, и чтобы у нас была более чёткая процедура снятия\n  модераторов с должности, и возвращения их в должность.</p>\n</blockquote>\n\n<p>Вы изменили политику в результате непрекращающихся проблем. Не потому, что вы поняли ошибку.</p>\n\n<p>Давайте проясним, модераторы постоянно говорят пользователям, что они не обсуждают отстранение пользователей, так почему же сотрудник посчитал нужным сделать это с прессой?</p>\n\n<p>Грубая халатность или простой злой умысел?</p>\n\n<blockquote>\n  <p>Мы уважаем г-жу Челлио и считаем, что она хороший человек, который\n  может многое предложить сообществу. Мы искренне надеемся, что она\n  останется активным членом нашего сообщества. Признавая ошибки, которые\n  привели нас сюда, мы предложили г-же Челлио подать заявку на возможное\n  восстановление полномочий модератора на всех шести сайтах, посредством\n  прохождения нашей новой процедуры восстановления модератора в\n  должности. Г-жа Челлио выразила озабоченность по поводу нового\n  процесса, и не стала подавать заявку.</p>\n</blockquote>\n\n<p>Опять же сказал адвокат, и из-за этого вы кажетесь невероятно неосведомленными.</p>\n\n<p>Как же <em>ХОРОШО</em> с вашей стороны '<em>пригласить</em>' ее подать заявление на восстановление <em>ХОТЯ</em> вы признали, что это были <strong>ВАШИ</strong> ошибки.</p>\n\n<p>Весь этот пост показывает, что вы возмещаете ущерб не потому, что вы действительно чувствуете, что была совершена ошибка, а потому, что это то, что вам сказали делать <strong><em>так</em></strong> адвокаты, если вы хотите чтобы все уладилось. Если вы собираетесь извиниться, делайте это, не рассказывая о недостатках другого человека.</p>\n\n<p>У Моники, должно быть, было очень хорошее дело, чтобы вы даже опубликовали этот пост.</p>\n\n<hr>\n\n<p>В любом случае, я рад, что Моника получила разрешение, которое она может подписать.</p>\n"}