{"owner":{"reputation":16190,"user_id":240512,"user_type":"registered","accept_rate":80,"profile_image":"https://i.stack.imgur.com/Ew6lG.png?s=128&g=1","display_name":"MSDN.WhiteKnight","link":"https://ru.meta.stackoverflow.com/users/240512/msdn-whiteknight"},"is_accepted":false,"score":5,"last_activity_date":1578214730,"creation_date":1578214730,"answer_id":9962,"question_id":9961,"body":"<blockquote>\n  <p>Этот вопрос создан с информационной целью - донести мысль, что Новогодний конкурс 2020 года является онтопиком сайта.</p>\n</blockquote>\n\n<p>Кто это сказал? Администрация, коллектив модераторов или вы лично? На каком основании изменения тематики объявляются на мете по факту, а не выносятся на предварительное обсуждение? Объявление диктатуры, кажется, не очень хороший способ празднования Нового Года? Напоминаю, еще недавно мы обсуждали соревнования (<a href=\"https://ru.meta.stackoverflow.com/questions/9472/%D0%9E%D1%84%D1%84%D1%82%D0%BE%D0%BF%D0%B8%D0%BA%D0%BE%D0%BC-%D0%BB%D0%B8-%D0%B1%D1%83%D0%B4%D0%B5%D1%82-%D0%B2%D0%BE%D0%BF%D1%80%D0%BE%D1%81-%D0%BA%D0%BE%D0%BD%D0%BA%D1%83%D1%80%D1%81-%D0%BD%D0%B0-%D1%81%D0%BE%D0%B7%D0%B4%D0%B0%D0%BD%D0%B8%D0%B5-%D0%BA%D0%BE%D0%BC%D0%BF%D1%8C%D1%8E%D1%82%D0%B5%D1%80%D0%BD%D0%BE%D0%B9-%D0%B8%D0%B3%D1%80%D1%8B-%D0%B4%D0%BB%D1%8F-%D0%B2%D0%B5%D0%B1-%D0%B1%D1%80%D0%B0%D1%83%D0%B7%D0%B5%D1%80?rq=1\">Оффтопиком ли будет вопрос-конкурс на создание компьютерной игры для веб браузера?</a>), и при этом не наблюдалось однозначного решения сообщества \"разрешить\".</p>\n\n<blockquote>\n  <p>Некоторые участники не оценили этот конкурс, считая его оффтопиком. Кто-то пытался закрыть как \"Слишком общий\". И это немного странно, учитывая что точно такой же конкурс был и в прошлом году.</p>\n</blockquote>\n\n<p>Что в этом странного? Участники имеют право выразить свое мнение, тем более что формально, если сопоставить вопрос с требованиями справки, он действительно подпадает под несколько причин закрытия. Существование незакрытых старых вопросов, не соответствующих правилам, не оправдывает задание новых. У нас полно старого незакрытого мусора типа \"Помогите не работает Skype\" висит незакрытым и удаляется духом только через год, просто потому что немногие заходят в метку, или потому что очереди перегружены.</p>\n\n<blockquote>\n  <p>Даже больше, у нас есть специальная меткм соревнование и code-golf. И напомню, что код-гольф у нас разрешён.</p>\n</blockquote>\n\n<p>Код-гольф, хоть и оторван от практики, существенно отличается от обсуждаемого конкурса, наличием четко сформулированного задания и критериев победы. \"<a href=\"https://ru.stackoverflow.com/questions/581668/%D0%9A%D0%BE%D0%B4-%D0%B3%D0%BE%D0%BB%D1%8C%D1%84-%D0%A0%D0%B5%D0%B0%D0%BB%D0%B8%D0%B7%D0%B0%D1%86%D0%B8%D1%8F-%D0%B0%D0%BB%D0%B3%D0%BE%D1%80%D0%B8%D1%82%D0%BC%D0%B0-%D0%B2%D1%8B%D0%B1%D0%BE%D1%80%D0%BA%D0%B8-%D0%BA%D0%BE%D0%BC%D0%B1%D0%B8%D0%BD%D0%B0%D1%86%D0%B8%D0%B9\">Реализовать наиболее короткий алгоритм выборки комбинаций</a>\" - вполне четкая и конкретная задача, почти по теме, если смотреть формально. Не вижу, как это дает основание считать обсуждаемый конкурс онтопиком.</p>\n\n<blockquote>\n  <p>Так что просим:</p>\n  \n  <ul>\n  <li>Не стоит закрывать такие вопросы (учитывая, что подобный конкурс лишь раз в год).</li>\n  <li>Не стоит ставить тревоги на таких вопросах (тревоги не для этого нужны)</li>\n  </ul>\n</blockquote>\n\n<p>ОК. Это не выглядит невыполнимой просьбой. Не исполнять какую-либо сложную обязанность, вроде определения соответствия вопросов правилам, всегда легко и приятно.</p>\n\n<blockquote>\n  <p>Ну и милости просим, вы всегда можете поучаствовать в конкурсе или предложить награду (◕‿◕)</p>\n</blockquote>\n\n<p>Спасибо. Я не имею отношения к веб-дизайну и графике, поэтому не собирался участвовать в конкурсе, как и не имею сильной позиции против него. Моя основная претензия к конкурсу, это то, что он слишком расплывчатый, нет определенных условий и критериев победы. Даже и сами формулировки непонятны:</p>\n\n<blockquote>\n  <p>Кроме тегов включенных в вопрос, допускается использовать ответы с дополнительными тегами.</p>\n</blockquote>\n\n<p>Что в данном случае подразумевается под тегами? HTML Tags? Или метки на сайте? В ответах и веб-дизайн, и консольная графика на С++, что заставляет склониться ко второму варианту. Правда, выглядит как гонка лыжника со сноубордистом.</p>\n\n<p>На мой взгляд, конкурс должен быть четко сформулирован, иметь конкретную (сложную, но достаточно открытую для творческих решений) задачу, определять правила и критерий победы (<strong>не</strong> рейтинг ответа - см обсуждение по ссылке выше). У нас сайт программистов, а не детский сад, соревнование должно быть спортивным. Если кто-то хочет проводить конкурсы с менее четкими условиями, я не имею сильной позиции против. Пусть это будет, но в порядке исключения, а не правила. Не нужно, пожалуйста, махать перед сообществом флагом с надписью \"Это насильно сделано онтопиком\" - это неприятно.</p>\n"}