{"owner":{"reputation":52838,"user_id":28748,"user_type":"registered","profile_image":"https://i.stack.imgur.com/LgbNe.jpg?s=128&g=1","display_name":"Alexandr_TT","link":"https://ru.meta.stackoverflow.com/users/28748/alexandr-tt"},"is_accepted":false,"score":5,"last_activity_date":1578511258,"creation_date":1578511258,"answer_id":9984,"question_id":9979,"body":"<p>Посмотрел ваш один ответ: <a href=\"https://ru.stackoverflow.com/q/1066935/28748\">Как в LyX настраивать прямой и обратный поиск?</a></p>\n\n<p>Только не обижайтесь, я хочу искренне вам помочь.</p>\n\n<p>Взгляните на свой топик отрешенно, глазами человека, который читает вопрос и может быть часть ответа. \nВопрос должен зацепить внимание за 5-10 секунд, сначала информативным заголовком в общем потоке, а затем началом подачи информации в ответе. Увы, это реальность, вам дано всего 5-10 секунд, чтобы заинтересовать. Сейчас мир перегружен потоком информации.</p>\n\n<p>Вы не задумывались, как работают мастера рекламы, в чём их успех? Мы все ненавидим рекламу, устали от неё, но тем не менее люди очень часто покупают именно те товары, которые увидели в рекламе.  Почему?</p>\n\n<p>Потому что используются основные инстинкты. Для женщин это: мой муж, мой ребенок, моя семья, моё здоровье и так далее. Поэтому в рекламе ключ к успеху слово, - <strong>моё</strong></p>\n\n<p>Для компьютерщиков основной инстинкт - узнать, изучить, что-то новое, что поможет их успеху. </p>\n\n<p>Теперь взгляните на свой вопрос глазами человека, который бороздит океаны информации </p>\n\n<blockquote>\n  <p>Прежде всего, всех с Рождеством Христовым! Собственно, у меня это\n  несеолько лет не получалось. Сейчас я это умею делать. Вот, хочу\n  поделиться</p>\n</blockquote>\n\n<p>Скорее всего это вызовет в лучшем случае улыбку, но может быть и негатив, за зря<br>\n потраченные 5 секунд :)  </p>\n\n<p>А вот, если бы вы обыграли в подаче вопроса, ту информацию, которая есть в описании метки, то это могло бы вызвать интерес: </p>\n\n<blockquote>\n  <p>использовать во всех вопросах связанных с LyX - свободным процессором\n  документов, основанным на системе компьютерной вёрстки LaTeX. LyX\n  является кроссплатформенным программным обеспечением и имеет готовые\n  сборки для Linux, Windows, Mac OS X.</p>\n</blockquote>\n\n<p><strong>Подача материала в ответе</strong>  </p>\n\n<p>У вас слепой текст, без абзацов. Это напрягает, утомляет, как людей, обладающих скорочтением, так и людей с пониженным зрением, да в общем то всех.  </p>\n\n<p>В подаче информации нужно стараться избегать очень подробного описания, но не упустить важных моментов. Люди сами смогут разобраться в мелочах, но будут вам благодарны за те нюансы, которые вы узнали в процессе экспериментов с продуктом.  </p>\n\n<p>Слова воспринимаются по разному, даже отточенные формулировки. Поэтому необходимо иллюстрировать важные моменты скринами с экрана. Да и визуальная информация всегда воспринимается лучше, чем слова. </p>\n"}