{"tags":["обсуждение","важное","причины-закрытия","домашки","цифры"],"owner":{"reputation":30268,"user_id":15479,"user_type":"moderator","accept_rate":51,"profile_image":"https://i.stack.imgur.com/hEsjL.png?s=128&g=1","display_name":"Suvitruf says Reinstate Monica","link":"https://ru.meta.stackoverflow.com/users/15479/suvitruf-says-reinstate-monica"},"is_answered":true,"view_count":595,"answer_count":5,"score":8,"last_activity_date":1579718317,"creation_date":1578859890,"last_edit_date":1579718317,"question_id":10013,"link":"https://ru.meta.stackoverflow.com/questions/10013/%d0%9d%d0%b5%d0%b1%d0%be%d0%bb%d1%8c%d1%88%d0%be%d0%b5-%d0%bf%d0%be%d0%b4%d0%b2%d0%b5%d0%b4%d0%b5%d0%bd%d0%b8%d0%b5-%d0%b8%d1%82%d0%be%d0%b3%d0%be%d0%b2-%d1%8d%d0%ba%d1%81%d0%bf%d0%b5%d1%80%d0%b8%d0%bc%d0%b5%d0%bd%d1%82%d0%b0-%d0%bf%d0%be-%d0%be%d1%82%d0%ba%d0%bb%d1%8e%d1%87%d0%b5%d0%bd%d0%b8%d1%8e-%d0%bf%d1%80%d0%b8%d1%87%d0%b8%d0%bd%d1%8b-%d0%b7%d0%b0%d0%ba%d1%80%d1%8b%d1%82%d0%b8%d1%8f-%d0%b2%d0%be%d0%bf%d1%80%d0%be%d1%81%d0%be%d0%b2","title":"Небольшое подведение итогов эксперимента по отключению причины закрытия вопросов &#171;учебные задания&#187;","body":"<p>Два месяца назад мы <a href=\"https://ru.meta.stackoverflow.com/q/9743/15479\">отключили</a> причину закрытия вопросов «учебные задания». Попробуем разобраться, к чему это привело. Данные предоставил <a href=\"https://meta.stackexchange.com/users/811/shog9\">Shog9</a>, за что ему спасибо.</p>\n\n<p>Вопросы, заданные и закрытые в течение 7 дней с момента создания (по неделям):</p>\n\n<p><a href=\"https://i.stack.imgur.com/mZ00e.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/mZ00e.png\" alt=\"введите сюда описание изображения\"></a></p>\n\n<ol>\n<li>Нет больших изменений в общем объёме закрытых вопросов.</li>\n<li>Использование других похожих причин увеличилось, поскольку исчезла одна причина.</li>\n</ol>\n\n<p>Посмотрим на другой график, который показывает эффективность первого голосования или тревоги на данном вопросе, по выбранной закрытой причине и неделе, когда он был поднят.</p>\n\n<p><a href=\"https://i.stack.imgur.com/4AhD6.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/4AhD6.png\" alt=\"введите сюда описание изображения\"></a></p>\n\n<ol>\n<li>Многие голоса за закрытие/тревоги не очень эффективны - они не приводят ни к закрытию вопроса, ни даже к рассмотрению на предмет закрытия.</li>\n<li>Дубликаты, как и на многих сайтах, как правило, наиболее эффективны - есть участники с золотыми баджем и тому подобное.</li>\n<li>С \"оффтопиком\", как правило, всегда не густо - но нет заметных изменений во время этого теста.</li>\n</ol>\n\n<p>Ещё две вещи:</p>\n\n<ol>\n<li><p>Люди не вводили старую причину в поле при выборе \"требуется вмешательство модератора\". Самая распространённая причина в свободной форме (да и она нечасто использовалась):</p>\n\n<blockquote>\n  <p>данный вопрос в виде картинки следует закрыть, потому что он бесполезен для базы знаний (тот, у кого возникнет подобный вопрос, не сможет найти данный вопрос и ответы к нему)</p>\n</blockquote></li>\n<li><p>Что случилось с тревогами или голосами с причиной, которую мы отключили? Было 65 вопросов с голосами/тревогами, ожидающими рассмотрения, на момент теста:</p>\n\n<pre><code>Questions Flagged as 'Учебные задания допустимы...' Closed as...\n--------------------------------------------------- ------------------------\n55                                                  null\n5                                                   Needs details or clarity\n1                                                   Needs more focus\n4                                                   Off-topic\n</code></pre></li>\n</ol>\n\n<p>Большинство (84%) из них - вообще не были закрыты. В предыдущем месяце только 44% не были закрыты. Между тем, эффективность тревог/голосов с причиной в целом осталась примерно одинаковой.</p>\n\n<p>Выводы Шога из всего вышесказанного:</p>\n\n<ol>\n<li>Как и на многих сайтах, вопросов, нуждающихся в закрытии, больше, чем людей, которые могут их закрыть. Таким образом, любое изменение - даже полное устранение одной причины - вряд ли повлияет на общий объём закрытых вопросов; другие вопросы будут закрыты по другим причинам.</li>\n<li>Не подтвердилось то, что вопросы, которые ранее закрывали как \"домашки\", теперь закрыты по другим причинам. Несомненно, некоторые вопросы были - как и в случае с 10 из 65, которые всё еще ожидали закрытия, когда начался тест, - но нет никаких доказательств того, что это было распространенным явлением. Впрочем, и нет свидетельств обратного.</li>\n</ol>\n\n<p>Это хоть какая-то пища к размышлению. Теперь хотелось бы услышать мнение сообщества по этому поводу. Желательно, всё же, хоть с какой-то аргументацией.</p>\n"}