{"tags":["обсуждение","правки"],"owner":{"reputation":47,"user_id":366178,"user_type":"registered","profile_image":"https://i.stack.imgur.com/DzDEC.jpg?s=128&g=1","display_name":"Rus","link":"https://ru.meta.stackoverflow.com/users/366178/rus"},"is_answered":false,"view_count":114,"answer_count":0,"score":1,"last_activity_date":1580273466,"creation_date":1580251771,"last_edit_date":1580273466,"question_id":10068,"link":"https://ru.meta.stackoverflow.com/questions/10068/%d0%ad%d1%82%d0%b8%d1%87%d0%bd%d0%be%d1%81%d1%82%d1%8c-%d0%bf%d1%80%d0%b0%d0%b2%d0%ba%d0%b8-%d0%b2%d0%be%d0%bf%d1%80%d0%be%d1%81%d0%b0-%d0%bd%d0%b5-%d0%b0%d0%b2%d1%82%d0%be%d1%80%d0%be%d0%bc","title":"Этичность правки вопроса не автором","body":"<p>Добрый вечер леди &amp; джентльмены.  </p>\n\n<p>Задал <a href=\"https://ru.stackoverflow.com/questions/1075425/%D0%9A%D0%B0%D0%BA-%D1%80%D0%B0%D0%B7%D1%80%D0%B5%D1%88%D0%B8%D1%82%D1%8C-%D0%BF%D0%BE%D0%BB%D1%8C%D0%B7%D0%BE%D0%B2%D0%B0%D1%82%D0%B5%D0%BB%D1%8E-%D0%B2%D1%8B%D0%B1%D1%80%D0%B0%D1%82%D1%8C-%D0%B8%D0%B7%D0%BE%D0%B1%D1%80%D0%B0%D0%B6%D0%B5%D0%BD%D0%B8%D0%B5-%D0%A2%D0%90%D0%9F-%D0%BE%D0%BC-%D0%BF%D0%BE-imageview\">вопрос</a>. Получил ответ. Начал согласно этого ответа проверять полученный код на практике. Результата не добился, в силу своей неопытности.<br>\nПолученные ошибки в виде кода и скриншота добавил в свой вопрос, исправив его самостоятельно.  </p>\n\n<p>В процессе общения выяснилось что кто-то удалил мои правки моего вопроса - то есть полностью код и скриншот. \nТо есть на полпути к решению получил отсутствие в самом тексте вопроса более половины составляющей.</p>\n\n<p>В данном случае я хотел бы спросить, <strong>насколько этично изменять текст вопроса, написанный другим автором?</strong></p>\n\n<p>Понимаю что более опытные люди могут подкорректировать теги, может быть кому-то режет глаз орфографическая ошибка или какая-то мелочь.<br>\nНо, совершенно не приемлемо вносить правки в текст другого автора, затрагивающий более 5% текста, без согласования с самим автором.<br>\nУтверждаю это со 100%-ной уверенностью, имея за плечами опыт работы главным редактором серьёзного средства массовой информации.</p>\n\n<p>И да, я понимаю, что задаваемые вопросы собираются в базу, которая потом будет использована. Согласен что эти вопросы и ответы также будут помогать другим пользователям сообщества. Но, в качестве обратной связи для Администрации ресурса, могу сказать, что правка кем-то текста моего вопроса более чем наполовину, мне сегодня была не приятна. \np.s. Ложечки-то конечно нашлись, но осадочек остался.</p>\n"}