---
title: "Помогите пожалуйста с кодом, выводит значения на 1 меньше"
se.owner.user_id: 517922
se.owner.display_name: "Andrew Cool"
se.owner.link: "https://ru.meta.stackoverflow.com/users/517922/andrew-cool"
se.link: "https://ru.meta.stackoverflow.com/questions/12166/%d0%9f%d0%be%d0%bc%d0%be%d0%b3%d0%b8%d1%82%d0%b5-%d0%bf%d0%be%d0%b6%d0%b0%d0%bb%d1%83%d0%b9%d1%81%d1%82%d0%b0-%d1%81-%d0%ba%d0%be%d0%b4%d0%be%d0%bc-%d0%b2%d1%8b%d0%b2%d0%be%d0%b4%d0%b8%d1%82-%d0%b7%d0%bd%d0%b0%d1%87%d0%b5%d0%bd%d0%b8%d1%8f-%d0%bd%d0%b0-1-%d0%bc%d0%b5%d0%bd%d1%8c%d1%88%d0%b5"
se.question_id: 12166
se.post_type: question
---
<p>Итак, вот сама задача:
&quot;Пифагоровы тройки&quot;
Напишите программу, которая находит тройки натуральных чисел a,b,c таких, что a⩽b⩽c⩽n и a^2+b^2=c^2.</p>
<p>Заметьте, что таким образом, вы найдёте все прямоугольные треугольники с целочисленными сторонами.</p>
<p>Формат входных данных
В первой строке содержится целое число n (1⩽n⩽103).</p>
<p>Формат результата
Выведите тройки a,b,c в лексикографическом порядке.</p>
<p>Пример:
Входные Данные:</p>
<p>15</p>
<p>Результат:</p>
<p>3 4 5</p>
<p>5 12 13</p>
<p>6 8 10</p>
<p>9 12 15</p>
<p>Вот мой код:</p>
<pre><code>def pif_triples(n):
    tmp = [k * k for k in range(1, n + 1)]
    res = []
    for i in range(1, n):
        for j in range(i, n):
            q = tmp[i] + tmp[j]
            if q in tmp:
                k = tmp.index(q)
                res.append((i, j, k + 1))
    return res


n = int(input())
for a in pif_triples(n):
    print(*a)
</code></pre>
<p>и при вводе 15, он выводит
2 3 5</p>
<p>4 11 13</p>
<p>5 7 10</p>
<p>8 11 15</p>
<p>Что делать, как поменять?</p>
