{"tags":["поддержка","модерация","правки"],"owner":{"reputation":4222,"user_id":192421,"user_type":"registered","accept_rate":25,"profile_image":"https://www.gravatar.com/avatar/e287adb1e5d34863c9e5a5aa6a73d67a?s=128&d=identicon&r=PG","display_name":"pepsicoca1","link":"https://ru.meta.stackoverflow.com/users/192421/pepsicoca1"},"is_answered":true,"view_count":96,"accepted_answer_id":9801,"answer_count":2,"score":-10,"last_activity_date":1575060466,"creation_date":1575051054,"last_edit_date":1575060466,"question_id":9800,"link":"https://ru.meta.stackoverflow.com/questions/9800/%d0%9a%d1%83%d0%b4%d0%b0-%d0%b6%d0%b0%d0%bb%d0%be%d0%b2%d0%b0%d1%82%d1%8c%d1%81%d1%8f-%d0%b5%d1%81%d0%bb%d0%b8-%d0%bd%d0%b5-%d1%81%d0%be%d0%b3%d0%bb%d0%b0%d1%81%d0%b5%d0%bd-%d1%81-%d0%b4%d0%b5%d0%b9%d1%81%d1%82%d0%b2%d0%b8%d1%8f%d0%bc%d0%b8-%d0%bc%d0%be%d0%b4%d0%b5%d1%80%d0%b0%d1%82%d0%be%d1%80%d0%b0","title":"Куда жаловаться, если не согласен с действиями модератора?","body":"<p>Только что один из модераторов поправил <a href=\"https://ru.stackoverflow.com/a/1051706/178988\">мой ответ</a> (версия 13) в соответствии с его понятиями о прекрасном.  Удалены некоторые предложения и переформатирован ответ. Мотив - \"Удалены неотносящиеся к ответу фразы\". А я считаю, что все фразы в ответе вполне относятся к ответу. Доколе будет продолжаться беспредел и есть ли управа на модераторов на этом благословенном сайте?</p>\n\n<p>UPD1:</p>\n\n<blockquote>\n  <p>На ответе стояла тревога \"Невежливый или оскорбительный\".</p>\n</blockquote>\n\n<p>Ну и что? Кому-то показалось что-то оскорбительным? А мне показалось, что баба Маня из соседнего подъезда слишком много пьёт и что теперь? Никакой нецензурной лексики в ответе не было, а все ваши фантазии можете оставить у себя в мониторе. Термин \"дикие Unix-оиды\" вполне литературное выражение, можете поинтересоваться милицейским справочником нецензурной лексики, так вот в нём термина \"дикие Unix-оиды\" нет. Следовательно, всё вполне цензурно.</p>\n\n<blockquote>\n  <p>Информация о том, кто по твоему мнению минусует сообщение, ответом\n  никак являться не может.\n  В комментариях ещё ладно, но точно не в ответе.</p>\n</blockquote>\n\n<p>Почему мне нельзя в ответе прокомментировать необъяснимую волну минусов?</p>\n\n<blockquote>\n  <p>Маркеры UPD 1 ... UPD N, очевидно, полезной информации не приносят.\n  Это ответ, а не чат.</p>\n</blockquote>\n\n<p>Маркеры UPD 1 ... UPD N играют важную роль, они показывают развитие диалога.</p>\n\n<blockquote>\n  <p>Я перенёс некоторые куски, которые мне было жалко удалять вместе с\n  жалобами на минусаторов, и постарался придать им связный вид.</p>\n</blockquote>\n\n<p>Вас никто не просил ничего редактировать. Если Вы имеете что-то сказать по делу, напишите свой ответ. Обещаю, что я не буду его править.</p>\n\n<blockquote>\n  <p>Это ответ и его вполне можно править дальше, если что-то из\n  исправлений не устраивает.</p>\n</blockquote>\n\n<p>Вот ещё не хватало мне устраивать гонки по вертикали со всякими доброхотами. Просто отстаньте от чужих ответов, это не Ваше дело - править чужие ответы.</p>\n\n<p>И да, зачем Вы удалили смайлы? Смайлы что, тоже под запретом на stackoverflow?</p>\n\n<p>UPD2:</p>\n\n<p>Почему из вопроса и из заголовка стерли ник модератора Qwertiy♦? Это что, запрещенное слово?</p>\n\n<p>UPD3:</p>\n\n<blockquote>\n  <p>Даже если в сообщении нет нецензурщины, оное всё равно может быть\n  обидным.</p>\n</blockquote>\n\n<p>Знаете, экстрасенсы все в отпуске. Не могу же я знать, что будет обидным для каждого из семи миллиардов пользователей интернета? Давайте уж как-то выруливать хотя бы к юридическим формулировкам оскорбления.</p>\n\n<p>UPD4:</p>\n\n<blockquote>\n  <p>На мете обсуждают ситуацию, а не конкретных людей.</p>\n</blockquote>\n\n<p>Вот такая ситуация - конкретный человек превышает свои полномочия и редактирует чужие ответы. Почему бы при этом не упомянуть его ник?</p>\n\n<p>UPD5:</p>\n\n<blockquote>\n  <p>Я не вижу, где бы я удалял смайлы.</p>\n</blockquote>\n\n<p>Вы даже не контролируете свои руки. Смайл удален после слов \"всей системы команд PDP-11.\"</p>\n\n<p>UPD6:</p>\n\n<blockquote>\n  <p>Ответ - это не диалог. Для диалогов есть чат. В крайнем случае\n  комментарии. Ответы же нужны для ответов на вопросы.</p>\n</blockquote>\n\n<p>Участники задают дополнительные вопросы в комментариях. Ответы на эти дополнительные вопросы слишком велики, чтобы быть помещенными в комментариях. Поэтому приходится дополнять ответ. Чтобы все не смешивалось в кучу, (чтобы не смешивалось в кучу и основной ответ и ответы на дополнительные вопросы) и служат маркеры UPD.</p>\n\n<p>UPD7:</p>\n\n<blockquote>\n  <p>Неправда, смайл на месте:</p>\n</blockquote>\n\n<p>А в истории правок этот смайл зачеркнут. Движок барахлит?</p>\n\n<p>UPD8:</p>\n\n<blockquote>\n  <p>Добавления нового фрагмента в вопрос вполне достаточно, помечать его\n  номером не требуется.</p>\n</blockquote>\n\n<p>Не требуется, но и не запрещается. Мне кажется, что если помечать новый фрагмент номером, то становится понятнее где кончается один ответ и где начинается следующий ответ. Если Вам так не кажется, Вы можете в своих ответах все валить в кучу. А мне уж позвольте форматировать мои ответы так, как мне кажется правильным.</p>\n\n<p>UPD9:</p>\n\n<blockquote>\n  <p>так что логично её удалить заодно.</p>\n</blockquote>\n\n<p>Логично просто никогда не лезть в чужие ответы. Повторю еще раз - если Вам что-то не нравится, Вы всегда можете написать свой ответ в котором сказать что линуксоиды вовсе не дикие, что Вы много раз кормили линуксоидов с рук и все пальцы у вас целы. Что Cmake это мейнстрим и все программисты в мире поголовно сейчас радостно пишут руками конфиги для Cmake. А также можете объяснить ТС ЗАЧЕМ ему бросать комфортное IDE и в 2019 году от Рождества Христова начинать руками писать конфиги для Cmake. В своем ответе Вы также можете никогда не употреблять маркеры UPD, отказаться от смайлов ну и вообще проделать все, что Вы хотите. </p>\n\n<p>UPD10:</p>\n\n<blockquote>\n  <p>Может, вместо того чтобы править поток сознания, лучше такие ответы\n  просто удалять?</p>\n</blockquote>\n\n<p>Может Вы,  Pavel Mayorov, покажете где у вас индульгенция определять у кого поток сознания а у кого нет?</p>\n"}