{"tags":["поддержка","локализация","справка","закрытие-вопросов","термины"],"owner":{"reputation":1212,"user_id":352119,"user_type":"registered","profile_image":"https://lh3.googleusercontent.com/a-/AAuE7mALENhduQMSUwfjOFXt6gsDn5ls8AuSRT5te7M=k-s128","display_name":"Yaroslav","link":"https://ru.meta.stackoverflow.com/users/352119/yaroslav"},"is_answered":true,"view_count":107,"answer_count":2,"score":-1,"last_activity_date":1576814693,"creation_date":1576786606,"last_edit_date":1576798653,"question_id":9897,"link":"https://ru.meta.stackoverflow.com/questions/9897/%d0%9e%d0%b4%d0%bd%d0%be%d0%b7%d0%bd%d0%b0%d1%87%d0%bd%d1%8b%d0%b9-%d0%be%d1%82%d0%b2%d0%b5%d1%82","title":"Однозначный ответ","body":"<p>Столкнулся с несколькими голосами на удаление темы из-за глупой формальности в описаниях русского SO, отсутствующей на основном SO.</p>\n\n<p>Повторяется дважды.</p>\n\n<p>Как причина закрытия</p>\n\n<blockquote>\n  <p>Невозможно дать объективный ответ 2 Вопрос порождает бесконечные\n  прения и дискуссии, основанные не на знаниях, а на мнениях. Для\n  получения ответа перефразируйте ваш вопрос так, чтобы на него можно\n  было дать <strong>однозначно правильный ответ,</strong> либо удалите вопрос вовсе.</p>\n</blockquote>\n\n<p>И в <a href=\"https://ru.stackoverflow.com/help/on-topic\">Справка > Как задавать вопросы : На какие темы здесь можно задавать вопросы?</a></p>\n\n<blockquote>\n  <p>Активные участники с высокой репутацией, а модераторы их скорее всего\n  поддержат, могут закрыть или заморозить ваш вопрос, если им покажется,\n  что он уже задавался или <strong>на него сложно дать однозначный</strong>, притом\n  краткий (не больше нескольких абзацев) <strong>ответ</strong> или ответы будут по\n  большей части зависеть от мнения отвечающих.</p>\n</blockquote>\n\n<p>Требование к ответу быть однозначным абсолютно бредовейшее, поскольку бывают задачи с более чем одним решением и удаление вопросов с такими задачами, как какой-то ереси это чистой воды культизм во славу однозначного мира! С такими культистами я к сожалению и столкнулся.</p>\n\n<p>В основном это касается консультационных вопросах с желанием узнать о перечне вариантов инструментов решения или методов реализации.</p>\n\n<p>В англоязычном <a href=\"https://stackoverflow.com/help/on-topic\">Help Center > Asking : What topics can I ask about here?</a> такого требования нет.</p>\n\n<blockquote>\n  <p>Please look around to see if your question has been asked before. It’s\n  also OK to ask and answer your own question. <strong>Questions which are too</strong>\n  <strong>broad</strong>, unclear, incomplete or primarily opinion-based may be closed by\n  the community until they are improved.</p>\n</blockquote>\n\n<p>Там просто просят, чтобы вопрос не был <strong>слишком широким</strong>. То есть речь о критериях.</p>\n\n<hr>\n\n<p><strong>П Р Е Д Л А Г А Ю</strong></p>\n\n<p>В тревоге. Цель: <code>тревога</code> должна стать инструментом по факту возникновения <strong>ЛИШЬ ВОЗМОЖНЫХ</strong> проблем (прения и дискуссии), а не на берегу, как сейчас, когда вопрос хоронят заочно. Презумпция невиновности.</p>\n\n<blockquote>\n  <p>Невозможно дать объективный ответ 2 Вопрос привёл к бесконечным\n  прениям и дискуссии, основанные не на знаниях, а на мнениях. Для\n  получения ответа перефразируйте ваш вопрос, сузив критерии искомого\n  ответа, либо удалите вопрос вовсе.</p>\n</blockquote>\n\n<p>В справке. </p>\n\n<blockquote>\n  <p>на него сложно дать однозначный, притом краткий (не больше нескольких\n  абзацев) ответ</p>\n</blockquote>\n\n<p>Речь о том, что с виду простой вопрос, на самом деле скрывает объёмную тему. И либо трудно говорить о конкретики без понимания темы, либо ответ влечёт пояснения по смежной теме, которые влекут другие пояснения. Данной проблематики не существует, поскольку люди пользуются <a href=\"https://docs.microsoft.com/ru-ru/dotnet/csharp/\" rel=\"nofollow noreferrer\">ссылками на материалы</a> указывая некий вектор и <a href=\"https://govnokod.ru/\" rel=\"nofollow noreferrer\">примеры кода</a>, причём зачастую несколько источников.</p>\n\n<blockquote>\n  <p>Активные участники с высокой репутацией, а модераторы их скорее всего\n  поддержат, могут закрыть или заморозить ваш вопрос, если им покажется,\n  что он уже задавался или ответы будут по большей части зависеть от\n  мнения отвечающих.</p>\n</blockquote>\n"}