{"tags":["поддержка","итоги-года"],"owner":{"reputation":45506,"user_id":6,"user_type":"moderator","accept_rate":10,"profile_image":"https://i.stack.imgur.com/dVTjR.jpg?s=128&g=1","display_name":"Nicolas Chabanovsky","link":"https://ru.meta.stackoverflow.com/users/6/nicolas-chabanovsky"},"is_answered":true,"view_count":1019,"answer_count":5,"score":11,"last_activity_date":1579553929,"creation_date":1577731584,"last_edit_date":1579238462,"question_id":9942,"link":"https://ru.meta.stackoverflow.com/questions/9942/c-%d0%9d%d0%be%d0%b2%d1%8b%d0%bc-2020-%d0%93%d0%be%d0%b4%d0%be%d0%bc","title":"C Новым 2020 Годом!","body":"<p>Уходящий год был насыщенным и довольно непростым как для сообщества, так и для компании. Мне лично запомнились следующие позитивные события нашей общей истории:</p>\n\n<ul>\n<li>В этом году команда модераторов <a href=\"https://ru.meta.stackoverflow.com/q/9229/6\">пополнилась</a> двумя участниками <a href=\"https://ru.stackoverflow.com/users/15479/\">Suvitruf</a> и <a href=\"https://ru.stackoverflow.com/users/213987/\">A K</a>.</li>\n<li>Репутация <a href=\"https://ru.meta.stackoverflow.com/q/8833/\">Harry</a> в сообществе превысила порог в 100 000 баллов.</li>\n<li><a href=\"https://ru.meta.stackoverflow.com/q/8572/6\">Размер создаваемой нами базы знаний перевалил за четверть миллиона вопросов</a>!</li>\n<li>В этом году мы вместе успешно завершили несколько невероятно важных инициатив. Например, добавили в справочный центр «<a href=\"/help/key-values\">ключевые ценности</a>» и «<a href=\"/help/manifesto\">манифест сообщества</a>».</li>\n</ul>\n\n<p>Уху! Так держать!</p>\n\n<h3>Год в цифрах</h3>\n\n<pre><code> -------------------------------------------------------------\n|                    | Stack Overflow     |  Stack Overflow   |\n|                    | на русском         |  на русском       |\n|                    | 2018 год           |  2019 год         |\n|--------------------|--------------------|-------------------|\n|  Задано вопросов   |     86 573         |    77 986         |\n|--------------------|--------------------|-------------------|\n|Опубликовано ответов|     70 969         |    56 949         |\n|--------------------|--------------------|-------------------|\n|  Новых участников  |     39 557         |    41 189         |\n -------------------------------------------------------------\n</code></pre>\n\n<h3>Несколько мыслей о будущем</h3>\n\n<ul>\n<li><p><em>Особое внимание отзывам участников</em>. Как я могу видеть, <a href=\"https://stackoverflow.blog/2019/11/25/introducing-the-loop-a-foundation-in-listening/\">компания взяла уверенный курс</a> на улучшения опыта участия на сайте. И, что очень важно, вводить улучшения планируется на основе отзывов участников сообщества. Хотя мы опирались на ваши идеи при принятии решений с самого первого дня, с этого года возможности поделиться своими мыслями о сайте будет ещё больше. Если вы хотели изменить что–либо на сайте, настало отличное время осуществить ваши планы!</p></li>\n<li><p><em>Видеочаты, встречи сообщества, конкурсы</em> и другие инициативы для «создания сообщества». Было бы здорово в новом году проводить больше подобных событий. </p></li>\n<li><p><em>Концентрация на миссии проекта</em>. Если мы сможем максимально эффективно избегать всего (и хорошего, и плохого), что пытается сместить фокус нашего внимания с миссии, создания базы знаний сообщества, сайт будет развиваться быстрее и принимать участие будет ещё приятнее. Один из способов — выбрать амбициозную цель и вместе сделать всё возможное для её достижения. </p></li>\n</ul>\n\n<p>За последние 10 лет ИТ-мир изменился до неузнаваемости: ещё в 2010 году нужно было несколько дней разбираться как собрать «Hello World проект» под первые версии ОС Андроид, сегодня же приложение для машины для проигрывания музыки из соц сетей пишутся на JavaScript за несколько часов. Изменилось и само сообщество. Во всём. И мне крайне приятно осознавать, что вот уже почти 10 лет мы с вами вместе являемся катализатором этих, безусловно, позитивных изменений. Большое спасибо нам всем за это! =)</p>\n\n<h3>Stack Overflow — это мы! Давайте поздравим друг друга!</h3>\n\n<p>Присоединяйтесь к поздравлениям! Пожалуйста, поделитесь наиболее приятными позитивными событиями из жизни сообщества, которые запомнились именно вам. Если в уходящем году кто–то из участников сделал вашу жизнь лучше, пожалуйста, не стесняйтесь поздравить его, сказать ему «спасибо» в ответе к этому вопросу. Уверен, этот участник будет очень рад вашему вниманию.</p>\n\n<p><img src=\"https://i.stack.imgur.com/9IKWu.jpg\" alt=\"введите сюда описание изображения\"></p>\n\n<p><em>Большое спасибо всем участникам сообщества <a href=\"https://ru.stackoverflow.com/\">Stack Overflow на русском</a>! Поздравляю с наступающим Новым Годом и желаю всего наилучшего! Буду рад видеть всех в Новом Году! Нас ждёт много всего интересного! =)</em> </p>\n"}