{"owner":{"reputation":16058,"user_id":240512,"user_type":"registered","profile_image":"https://i.stack.imgur.com/Ew6lG.png?s=128&g=1","display_name":"MSDN.WhiteKnight","link":"https://ru.stackoverflow.com/users/240512/msdn-whiteknight"},"is_accepted":true,"score":6,"last_activity_date":1520328563,"creation_date":1520328563,"answer_id":794355,"question_id":790538,"body":"<p>Если речь идет только о работе в IDE, для приостановки работы программы можно использовать обычные точки останова и отладчик, какие-то специальные вызовы в коде не нужны. Более того, использование вызовов типа <em>system(\"pause\")</em> приведет к тому, что программу невозможно будет нормально вызывать из пакетных файлов: она будет каждый раз ждать ввода с реальной консоли, даже если стандартный ввод перенаправлен из файла и ожидалась работа без участия пользователя. Но, если все же <strong>действительно</strong> нужно приостановить консоль при любом запуске программы, есть несколько вариантов:</p>\n\n<pre><code>system(\"PAUSE\");\n</code></pre>\n\n<p>Особенности:</p>\n\n<ul>\n<li>Отображает приглашение ввода (\"Нажмите любую клавишу\")</li>\n<li>Прерывает работу программы до нажатия любой клавиши</li>\n<li>Работает только под Windows (в других ОС нет команды PAUSE)</li>\n<li>Внутренне вызывает командный интерпретатор, поэтому считается \"тяжелым\" вариантом (если производительность что-то значит в данном случае)</li>\n</ul>\n\n<p>Есть миф, что такой вызов небезопасен, так как если поместить в папку с программой вредоносный файл pause.exe, он будет вызван вместо команды PAUSE. Это не так в современных версиях Windows.</p>\n\n<pre><code>system(\"PAUSE&gt;nul\");\n</code></pre>\n\n<p>То же самое, но не отображает приглашение ввода.</p>\n\n<pre><code>getchar(); //С\ncin.get(); //C++\n</code></pre>\n\n<p>Особенности:</p>\n\n<ul>\n<li>Не отображает приглашение ввода</li>\n<li>Прерывает работу программы до нажатия клавиши Enter</li>\n<li>Стандартная функция - работает в любом окружении</li>\n</ul>\n\n<p>В отличие от других вариантов, не ломает перенаправление стандартного ввода (достаточно поместить на вход строку любого содержания, и выполнение программы пойдет дальше).</p>\n\n<pre><code>#include &lt;conio.h&gt;\ngetch(); //Традиционная\n_getch(); //Современный вариант\n</code></pre>\n\n<p>Особенности:</p>\n\n<ul>\n<li>Не отображает приглашение ввода</li>\n<li>Прерывает работу программы до нажатия любой клавиши</li>\n<li>Нестандартная функция, доступна в DOS и Windows (в других ОС есть похожие аналоги)</li>\n</ul>\n\n<p>Опять же, существует миф, что в Windows это какой-то DOSовский вызов и использовать его - дикий криминал. На самом деле, внутренне он реализуется как обычный вызов WINAPI-функции <em>ReadConsoleInput</em>, с предварительным отключением у консоли режима <em>ENABLE_LINE_INPUT</em>. Убедиться в этом можно, заглянув в исходники отладочной версии CRT, которые с некоторого времени частично открыты.</p>\n"}