{"owner":{"reputation":16058,"user_id":240512,"user_type":"registered","profile_image":"https://i.stack.imgur.com/Ew6lG.png?s=128&g=1","display_name":"MSDN.WhiteKnight","link":"https://ru.stackoverflow.com/users/240512/msdn-whiteknight"},"is_accepted":true,"score":1,"last_activity_date":1522000993,"creation_date":1522000993,"answer_id":804536,"question_id":803379,"body":"<p>На самом деле, кодовая страница для консольных приложений не является настройкой, которую можно изменить через Visual Studio. Дело в том, что не существует никакой \"консоли Visual Studio\" - при запуске консольного приложения из студии используется самая обычная консоль ОС, та же самая, что и для cmd.exe или любого другого консольного приложения (она может отличаться внешне, в зависимости от настроек, но суть та же). Кодовую страницу для нее можно задать: </p>\n\n<ul>\n<li><p>На уровне ОС, установкой <a href=\"https://superuser.com/questions/269818/change-default-code-page-of-windows-console-to-utf-8\">определенных ключей реестра</a></p></li>\n<li><p>В конкретном сеансе командной оболочки, выполнением команды <code>chcp 1251</code>. Таким образом, можно изменить действие при запуске приложения (в разделе \"Отладка\" в свойствах проекта) на <code>c:\\windows\\system32\\cmd.exe /k chcp 1251 &amp;&amp; $(TargetPath)</code> для достижения требуемого эффекта. Но тогда отладчик будет отлаживать cmd.exe, а не нашу программу :(</p></li>\n<li><p>Для конкретного консольного приложения через параметр реестра <code>HKCU\\Console\\(путь к приложению)\\CodePage</code> (REG_DWORD). </p></li>\n</ul>\n\n<p>Используя последний способ и шаблоны проектов, можно автоматизировать установку кодовой страницы для приложений, собираемых в студии. </p>\n\n<ol>\n<li><p>Создадим bat-файл следующего содержания:</p>\n\n<pre><code>set MYSTRING=%~1\nreg add \"HKCU\\Console\\%MYSTRING:\\=_%\" /v CodePage /t REG_DWORD /f /d 1251\n</code></pre></li>\n</ol>\n\n<p>Поместим его, допустим, в папку <em>c:\\scripts\\codepage.bat</em></p>\n\n<ol start=\"2\">\n<li><p>Создадим проект консольного приложения под шаблон, допустим <em>Cp1251ConsoleApplication</em>  </p></li>\n<li><p>В свойствах проекта, в разделе <strong>События построения - Событие после построения</strong>, введем в параметр <strong>Командная строка</strong> значение: </p>\n\n<pre><code>c:\\scripts\\codepage.bat \"$(TargetPath)\"\n</code></pre></li>\n<li><p>Нажмем в меню <strong>Файл - Экспорт шаблона</strong> или <strong>Проект - Экспорт шаблона</strong>, зададим параметры шаблона (галка \"Автоматически импортировать в Visual Studio\" должна быть отмечена), и нажмем <strong>Готово</strong></p></li>\n</ol>\n\n<p>Теперь при создании нового проекта в в разделе Visual C++ появится шаблон <em>Cp1251ConsoleApplication</em>. Если создавать проект на его основе, при сборке проекта в реестре автоматически будет устанавливаться кодовая страница консоли для этого приложения. Недостаток способа в том, что этот раздел реестра будет замусориваться, если создавать много проектов.</p>\n\n<p>Также, при задействовании команды <strong>Запуск без отладки</strong> способ не сработает: вместо вашего приложения будет запускаться cmd.exe; для него кодовая страница настраивается отдельно - созданием точно такой же ветки в реестре с путем к cmd.exe.</p>\n\n<p>Подробнее о настройках консоли: <a href=\"https://blogs.msdn.microsoft.com/commandline/2017/06/20/understanding-windows-console-host-settings/\" rel=\"nofollow noreferrer\">Understanding Windows Console Host Settings</a></p>\n"}