{"owner":{"reputation":12896,"user_id":186752,"user_type":"registered","accept_rate":87,"profile_image":"https://i.stack.imgur.com/dRPDg.jpg?s=128&g=1","display_name":"Andrew","link":"https://ru.stackoverflow.com/users/186752/andrew"},"is_accepted":true,"score":3,"last_activity_date":1551355515,"last_edit_date":1551355515,"creation_date":1551352096,"answer_id":950538,"question_id":950524,"body":"<blockquote>\n  <p>а есть ли где-нибудь универсальный способ получения html-кода всей страницы?</p>\n</blockquote>\n\n<p>Существует слишком много технологий которые нужно учитывать. Есть сайты где есть AJAX подгрузка страницы. Вечная загрузка страницы (например новостная лента в вк) или, скажем, подгрузка таблицы в страницу по нажатию на кнопку.</p>\n\n<p>Как ты получишь полный хтмл страницы одним запросом?</p>\n\n<p>Или, скажем, ты делаешь запрос, добавляешь куки нужные учитываешь аджакс подгрузку по нажатию на кнопки каким-то хитрым макаром (например вызывая JS) или используя виртуальную прокрутку(например вызывая некий JS), а потом тебя перенаправляет для загрузку файла на другой хостнейм. И здесь нужно еще учитывать CORS (Cross-origin resource sharing). </p>\n\n<p>И так далее.</p>\n\n<p><strong>Короче, что бы полностью обрабатывать все-все-все случаи жизни тебе нужно НАПИСАТЬ СВОЙ ДВИЖОК БРАУЗЕРА</strong>. Ну или использовать уже готовый.</p>\n\n<hr>\n\n<h1>Так что ответ на вопрос:</h1>\n\n<p>Есть. <em>[Точнее есть способ максимально приблизить страницу к той которой видит пользователь]</em> Используй полноценный движок браузера.  Можно headless (вроде phantomjs или CEF.headless), можно с юаем, например Gecko или CEF. В таком случае ты сможешь получать полный хтмл учитывая все-все-все нюансы которые нужно учитывать при подгрузке ЛЮБОЙ странцы <em>(собственно, движки браузеров именно для этого и созданны, не так ли?)</em></p>\n\n<hr>\n\n<p>Если же ты хочешь в пниципе разобратся какими способами можно сайты парсить, я расписывал основные пути вот здесь:\n<a href=\"https://ru.stackoverflow.com/a/609646/186752\">https://ru.stackoverflow.com/a/609646/186752</a> и там ты сможешь сориентироватся что тебе нужно под твои нужды, а потом уже копать в нужном направлении детали реализации.</p>\n"}