{"owner":{"reputation":16058,"user_id":240512,"user_type":"registered","profile_image":"https://i.stack.imgur.com/Ew6lG.png?s=128&g=1","display_name":"MSDN.WhiteKnight","link":"https://ru.stackoverflow.com/users/240512/msdn-whiteknight"},"is_accepted":true,"score":9,"last_activity_date":1501932104,"creation_date":1501932104,"answer_id":702282,"question_id":546269,"body":"<p>В WPF существует механизм автоматического замещения (fallback) шрифтов. (См. <a href=\"https://msdn.microsoft.com/en-us/library/system.windows.media.fontfamily.aspx\" rel=\"noreferrer\">MSDN: FontFamily</a>.) Если указанный физический шрифт не удается найти на целевой системе, вместо него используется составной (composite) шрифт Global User Interface. По сути это XML-файл, который содержит параметры шрифта (в т.ч. и Baseline) и сопоставления диапазонов символов физическим шрифтам. Этот файл лежит в</p>\n\n<blockquote>\n  <p>%WINDIR%\\MICROSOFT.NET\\Framework\\версия\\WPF\\Fonts\\GlobalUserInterface.COMPOSITEFONT</p>\n</blockquote>\n\n<p>Диапазону символов 0000-052F (куда и входят английские буквы) в нем сопоставлены следующие шрифты: </p>\n\n<blockquote>\n  <p>Segoe UI, Tahoma, Arial, Simplified Arabic, Traditional Arabic, Arial\n  Unicode MS, Microsoft Sans Serif, Lucida Sans Unicode</p>\n</blockquote>\n\n<p>Параметры шрифта по умолчанию следующие:</p>\n\n<p><strong>Baseline:</strong> 0.9</p>\n\n<p><strong>Line spacing:</strong> 1.2</p>\n\n<p>Таким образом, как Segoe UI, так и Arial могут, в зависимости от ситуации, замещать не найденные шрифты (при этом вид будет отличаться от соответствующих \"нормальных\" шрифтов, из-за отличающихся LineSpacing и BaseLine). При указании пустой строки вместо шрифта используется Arial, поскольку он прописан как NullFontFamilyCanonicalName в коде модуля <a href=\"http://referencesource.microsoft.com/#PresentationCore/Core/CSharp/System/Windows/Media/FontFamily.cs,d652308aa7fc6dd3\" rel=\"noreferrer\">FontFamily.cs</a>:</p>\n\n<pre><code>internal static readonly CanonicalFontFamilyReference NullFontFamilyCanonicalName = CanonicalFontFamilyReference.Create(null, \"#ARIAL\"); \n</code></pre>\n\n<p>При указании несуществующего шрифта используется Segoe UI, так как он является шрифтом по умолчанию для GUI в Windows Vista и всех более поздних ОC. См. <a href=\"https://blog.davidpadbury.com/2008/08/30/change-the-default-font-of-a-wpf-application/\" rel=\"noreferrer\">Change the Default Font of a WPF Application</a>.</p>\n\n<p>Если вас не устраивают параметры Composite Font по умолчанию, можно отредактировать XML-файл (там несколько секций, надо брать соответствующую вашей ОС). Но лучше, я полагаю, этого не делать, и просто не ошибаться в шрифтах.</p>\n"}