{"owner":{"reputation":1980,"user_id":254190,"user_type":"registered","profile_image":"https://www.gravatar.com/avatar/e1cbe40b80c3fa8af2601552a1060814?s=128&d=identicon&r=PG&f=1","display_name":"bukkojot","link":"https://ru.stackoverflow.com/users/254190/bukkojot"},"is_accepted":false,"score":1,"last_activity_date":1512472020,"creation_date":1512472020,"answer_id":754074,"question_id":753833,"body":"<p>Преподаватель или работодатель, который дал такое задание, или жестоко постебался, или автор вопроса рассказал какой он супер-спец и ему дали задание под стать его рассказам. Для выполнения этого задания требуются достаточно специфичные знания. Но судя по вопросу, у автора вопроса нету даже начальных знаний, поэтому дальше можно не читать.</p>\n\n<p>Для тех же, кто наткнется на этот вопрос спустя много лет и тоже будет озадачен чем-то таким, то:</p>\n\n<ol>\n<li>Спрашиваем пользователя о номере кластера и устройстве (предполагается, что опрос оборудования и гуй к нему человек уже умеет делать, равно как и открывать устройства, как дали пример в соседнем ответе)</li>\n<li>Определяем тип файловой системы, благо не так много систем, где есть понятие \"кластер\", а метка \"винапи\" сужает их всего до 3х штук (известных мне на данный момент). Можно по сигнатуркам, но в самих спеках Мелкософт советует так не делать, а обращать внимание на значения в тех или иных полях загрузочного сектора.</li>\n<li>Парсим файловую структуру всего диска. Для НТФС достаточно просто зачитать весь МФТ и найти где же там нужный кластер, для ФАТов придется побегать по дереву директорий, пока не найдем нужное. Ну и что нашли, то и выводим на экран</li>\n</ol>\n\n<p>Как видим, все в общем-то просто. Осталось прочитать несколько спецификаций страниц эдак на 200-300 и тупо реализовать. Я нечто подобное делал несколько месяцев, но так и не доделал, запрокрастинировав свой проект.</p>\n\n<p>Если бы я был соискателем работы, то такое тестовое задание бы служило индикатором, что работодатель действительно хороший, а не очередная шарага. Но знания, которые тут потребуются, достаточно специфичные. Я бы очень долго искал, чем же на самом деле занимается такая конторка, прежде чем туда зааплаиться.</p>\n"}