{"owner":{"reputation":16058,"user_id":240512,"user_type":"registered","profile_image":"https://i.stack.imgur.com/Ew6lG.png?s=128&g=1","display_name":"MSDN.WhiteKnight","link":"https://ru.stackoverflow.com/users/240512/msdn-whiteknight"},"is_accepted":false,"score":1,"last_activity_date":1514221641,"creation_date":1514221641,"answer_id":763170,"question_id":753484,"body":"<blockquote>\n  <p>На более мощном ПК не работает, на стареньком все отрабатывает</p>\n</blockquote>\n\n<p>Если проблема проявляется только на отдельных машинах, вам нужно смотреть, что отличается на проблемной машине в конфигурации DirectShow. Видимо какой-то кодек вызывает проблему, генерируя поток неподходящего формата. AForge использует DirectShow, беглый просмотр исходников <a href=\"https://github.com/cureos/aforge/blob/master/Sources/Video.DirectShow/FileVideoSource.cs\" rel=\"nofollow noreferrer\">FileVideoSource</a> показывает следующую методику построения графа:</p>\n\n<ul>\n<li><p>Автоматически вставляется выбранный системой source filter (через <code>AddSourceFilter</code>)</p></li>\n<li><p>Создается Sample Grabber, настроенный на формат видео <code>MediaSubType.RGB24</code></p></li>\n<li><p>Sample Grabber подцепляется к первому найденному видео-выходу source filter</p></li>\n</ul>\n\n<p>Слабое место в этой схеме - явное указание <code>MediaSubType</code>. Насколько я знаю, если в видеопотоке SubType будет несовместимым с RGB24 (например YUY2), ошибки не выведется, но событие нового кадра никогда не вызовется. Поэтому работоспособность этого класса полностью зависит от того, какой формат будет генерировать декодер видео для конкретного файла на целевой машине.</p>\n\n<p>Вы можете попробовать следующее:</p>\n\n<ul>\n<li><p>Распространять вместе с программой кодеки, которые гарантированно выдают формат RGB для выходного потока видео, и настраивать их так, чтобы они автоматически выбирались системой (имели наивысший приоритет).</p></li>\n<li><p>Вместо иcпользования AForge, напрямую использовать DirectShow.NET (или модифицировать AForge, пользуясь тем, что это Open Source), и исправить данный недостаток. Нужно при вызове <code>SetMediaType</code> вместо явного SubType указывать нулевой GUID - тогда Sample Grabber будет принимать все форматы. И, соответственно, нужно предусмотреть преобразование из других форматов в RGB.</p></li>\n</ul>\n"}