{"owner":{"user_type":"does_not_exist","display_name":"user239133"},"is_accepted":false,"score":2,"last_activity_date":1520030800,"creation_date":1520030800,"answer_id":792814,"question_id":790343,"body":"<p>Вы уже задавали этот вопрос, а я отвечал. Попытаюсь ответить лучше, чем в прошлый раз.</p>\n\n<blockquote>\n  <p>ОКНО</p>\n</blockquote>\n\n<p>Пусть шум это синус (наводка сети электроснабжения, например). Фотографируем фрагмент шума, чтобы потом алгоритмом FFT получить его спектр:</p>\n\n<p><a href=\"https://i.stack.imgur.com/Mbet7.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/Mbet7.png\" alt=\"введите сюда описание изображения\"></a></p>\n\n<p>Кажется, что это синус, но на самом деле это вот что:<a href=\"https://i.stack.imgur.com/LJCSc.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/LJCSc.png\" alt=\"введите сюда описание изображения\"></a></p>\n\n<p>Резкий перепад, выделенный красным - это очень сильное искажение. Если вы прослушаете это в наушниках ушами, то поймете, что это совсем не тот шум, который вы хотите вычесть из своего сигнала. Чтобы уменьшить искажение, применяется окно (не ликвидировать, ведь окно само вносит искажения в сигнал):</p>\n\n<p><a href=\"https://i.stack.imgur.com/tzE7G.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/tzE7G.png\" alt=\"введите сюда описание изображения\"></a></p>\n\n<p>Результат применения окна:</p>\n\n<p><a href=\"https://i.stack.imgur.com/Kl6dJ.png\" rel=\"nofollow noreferrer\"><img src=\"https://i.stack.imgur.com/Kl6dJ.png\" alt=\"введите сюда описание изображения\"></a></p>\n\n<p>Это была работа с образцом шума.</p>\n\n<p>Теперь можно выполнить БПФ на этом образце шума и получить его спектр. Дальше, на каждом входном блоке сигнала можно так же выполнить БПФ и получить его спектр.</p>\n\n<p>Что получится, если попытаться вычесть на каждой частоте абсолютное значение спектра шума из абсолютного значения спектра сигнала. Получится то, что этой операции в принципе соответствует умножение спектра данного блока сигнала на некоторый другой спектр, то есть применение цифрового фильтра. Только для следующего блока входного сигнала этот фильтр будет уже другим. В результате ситуация будет примерно как на второй картинке - разрывы на границах блоков.</p>\n\n<p>Лично я вышел из этой ситуации следующим образом: применял к блоку сигнала сразу оба фильтра и линейно интерполировал результат, то есть в первой точке блока сигнала действовал только первый фильтр, в последней - только второй, и так линейно.</p>\n"}