{"owner":{"reputation":16068,"user_id":240512,"user_type":"registered","profile_image":"https://i.stack.imgur.com/Ew6lG.png?s=128&g=1","display_name":"MSDN.WhiteKnight","link":"https://ru.stackoverflow.com/users/240512/msdn-whiteknight"},"is_accepted":false,"score":1,"last_activity_date":1526466455,"creation_date":1526466455,"answer_id":828628,"question_id":828325,"body":"<p>При передаче в режиме chunked перед каждым фрагментом передается его размер в шестнадцатеричном виде. Соответственно, вместо Content Length нужно использовать это значение.</p>\n\n<blockquote>\n  <p>Браузер точно так же пишет. Мне в gzip приходит, а ему нет. Почему? </p>\n</blockquote>\n\n<p>Когда вы указываете <code>Accept-Encoding: gzip, deflate, br</code>, вы указываете предпочтительные форматы для передачи. Сервер может выбрать другой формат, если он считает сжатие нецелесообразным или из-за перегрузки не может его выполнять. Нет правила, что на один и тот же запрос в разные моменты времени должен придти один и тот же ответ. </p>\n\n<p>Из <a href=\"https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Accept-Encoding\" rel=\"nofollow noreferrer\">https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Accept-Encoding</a></p>\n\n<blockquote>\n  <p>Even if both the client and the server supports the same compression\n  algorithms, the server may choose not to compress the body of a\n  response, if the identity value is also acceptable. Two common cases\n  lead to this:</p>\n  \n  <ul>\n  <li>The data to be sent is already compressed and a second compression won't lead to smaller data to be transmitted. </li>\n  <li>This may the case with some image formats; The server is overloaded and cannot afford the computational overhead induced by the\n  compression requirement. Typically, Microsoft recommends not to\n  compress if a server use more than 80 % of its computational power.</li>\n  </ul>\n</blockquote>\n\n<p>Чтобы явно требовать передачу со сжатием, нужно указать что-то такое:</p>\n\n<pre><code>Accept-Encoding: deflate, gzip, *;q=0\n</code></pre>\n\n<p>Чтобы наоборот, требовать обязательной передачи без сжатия - такое:</p>\n\n<pre><code>Accept-Encoding: identity, *;q=0\n</code></pre>\n"}