{"owner":{"reputation":16117,"user_id":240512,"user_type":"registered","profile_image":"https://i.stack.imgur.com/Ew6lG.png?s=128&g=1","display_name":"MSDN.WhiteKnight","link":"https://ru.stackoverflow.com/users/240512/msdn-whiteknight"},"is_accepted":true,"score":1,"last_activity_date":1539935185,"last_edit_date":1539935185,"creation_date":1539930695,"answer_id":895104,"question_id":894872,"body":"<p>Самое простое, что приходит в голову - рекурсивно обойти все элементы, спуститься до уровня текстовых узлов, перевести каждый из них по отдельности и заменить его содержимое переводом. Допустим, имеем такой код для перевода строки через API Яндекса (взято <a href=\"https://vscode.ru/prog-lessons/rabota-s-api-yandex-perevodchika.html\" rel=\"nofollow noreferrer\">отсюда</a>):</p>\n\n<pre><code>using System.Collections.Generic;\nusing System.IO;\nusing System.Net;\nusing System.Text;\nusing System.Threading.Tasks;\nusing System.Net.Http;\nusing Newtonsoft.Json;\n//Reference: System.Net.Http, Newtonsoft.Json\n\nnamespace TranslateTest\n{\n    class Translator\n    {\n        public static async Task&lt;string&gt; Translate(string s, string lang)\n        {\n            if (s.Length &gt; 0)\n            {                \n\n                string content = \"text=\" + WebUtility.UrlEncode(s);\n                var cnt = new StringContent(content, Encoding.UTF8, \"application/x-www-form-urlencoded\");\n\n                HttpClient client = new HttpClient();\n                var response = await client.PostAsync(\n                    \"https://translate.yandex.net/api/v1.5/tr.json/translate?lang=\" + lang\n                    + \"&amp;key=APIKEY\",\n                    cnt\n                    );\n                var stream = await response.Content.ReadAsStreamAsync();                \n\n                using (var sr = new StreamReader(stream))\n                {\n                    string line;\n\n                    if ((line = sr.ReadLine()) != null)\n                    {\n                        if ((int)response.StatusCode != 200) throw new Exception(line);\n\n                        Translation translation;\n\n                        translation = JsonConvert.DeserializeObject&lt;Translation&gt;(line);    \n\n                        s = \"\";\n\n                        foreach (string str in translation.text)\n                        {\n                            s += str;\n                        }\n                    }\n                }\n\n\n                return s;\n            }\n            else\n                return \"\";\n        }\n    }\n\n    class Translation\n    {\n        public string code { get; set; }\n        public string lang { get; set; }\n        public string[] text { get; set; }\n    }\n}\n</code></pre>\n\n<p>Тогда код для перевода HTML-документа будет выглядеть так (у меня используется MSHTML):</p>\n\n<pre><code>using System;\nusing System.Text;\nusing System.Runtime.InteropServices;\nusing System.Threading.Tasks;\nusing System.Windows.Forms;\n//Reference: COM -&gt; Microsoft HTML Object Library\n\nnamespace TranslateTest\n{\n    public partial class Form1 : Form\n    {\n        public Form1()\n        {\n            InitializeComponent();\n        }        \n\n        private async void button1_Click(object sender, EventArgs e)\n        {   \n            string html;                \n            html = System.IO.File.ReadAllText(\"c:\\\\test\\\\test.html\");\n\n            textBox2.Text = await TranslateDocument(html);\n\n        }\n\n        string lang = \"en-ru\";\n\n        public async Task&lt;string&gt; TranslateDocument(string html)\n        {                \n            mshtml.HTMLDocument doc = null;\n            mshtml.IHTMLDocument2 d2 = null;\n            mshtml.IHTMLDocument3 d = null;\n            mshtml.IHTMLElementCollection body = null;\n            mshtml.IHTMLElement bodyelem = null;\n            mshtml.IHTMLDOMNode bodynode = null;\n\n            try\n            {\n                //грузим документ в парсер\n                doc = new mshtml.HTMLDocument();\n                d2 = (mshtml.IHTMLDocument2)doc;\n                d2.write(html);\n\n                //находим body\n                d = (mshtml.IHTMLDocument3)doc;\n                body = d.getElementsByTagName(\"body\");\n                if (body.length == 0) throw new Exception(\"Fatal error: HTML has no BODY tag!\");\n\n                bodyelem = body.item(0);                \n                bodynode = bodyelem as mshtml.IHTMLDOMNode;\n\n                //рекурсивно переводим все узлы элемента body\n                foreach (var node in bodynode.childNodes)\n                {\n                    await TranslateNode(node);\n                }\n\n                return bodyelem.innerHTML;\n            }\n            finally\n            {\n                //освобождение ресурсов\n                if (doc != null) Marshal.ReleaseComObject(doc);\n                if (d2 != null) Marshal.ReleaseComObject(d2);\n                if (d != null) Marshal.ReleaseComObject(d);\n                if (body != null) Marshal.ReleaseComObject(body);\n                if (bodyelem != null) Marshal.ReleaseComObject(bodyelem);\n                if (bodynode != null) Marshal.ReleaseComObject(bodynode);\n            }\n\n        }  \n\n        public async Task TranslateNode(mshtml.IHTMLDOMNode node)\n        {\n            string val = \"\";\n\n            if (node.nodeType == 3) //text node\n            {\n                val = node.nodeValue;\n                if (val.Trim().Length == 0) return; //пусто - нечего переводить\n\n                var res = await Translator.Translate(val, lang); //переводим содержимое узла           \n                node.nodeValue = res; //меняем содержимое на перевод\n            }\n            else //element node\n            {\n                //не переводим скрипты и CSS\n                if (node.nodeName.ToLower() == \"script\" || node.nodeName.ToLower() == \"style\") return;\n\n                //обход дочерних узлов\n                foreach (mshtml.IHTMLDOMNode x in node.childNodes)\n                {\n                    await TranslateNode(x);\n                }\n            }                \n\n        }\n    }\n}\n</code></pre>\n\n<p>Пример исходного текста и перевода:</p>\n\n<pre><code>&lt;p&gt;&lt;b&gt;The Antarctic&lt;/b&gt; is a polar region around the Earth's South Pole, opposite the Arctic region around the North Pole. The Antarctic comprises the continent of Antarctica and the island territories located on the Antarctic Plate. The Antarctic region include the ice shelves, waters, and island territories in the &lt;i&gt;Southern Ocean&lt;/i&gt; situated south of the Antarctic Convergence, a zone approximately 32 to 48 km (20 to 30 mi) wide varying in latitude seasonally. The region covers some 20 percent of the Southern Hemisphere, of which 5.5 percent (14 million km2) is the surface area of the Antarctic continent itself. All of the land and ice shelves south of 60°S latitude are administered under the Antarctic Treaty System. Biogeographically, the Antarctic ecozone is one of eight ecozones of the Earth's land surface.&lt;/p&gt;\n\n&lt;h2&gt;Geography&lt;/h2&gt;\n&lt;div&gt;\n&lt;p&gt;\nThe maritime part of the region constitutes the area of application of the international Convention for the Conservation of Antarctic Marine Living Resources (CCAMLR), where for technical reasons the Convention uses an approximation of the Convergence line by means of a line joining specified points along parallels of latitude and meridians of longitude. The implementation of the Convention is managed through an international Commission headquartered in Hobart, Australia, by an efficient system of annual fishing quotas, licenses and international inspectors on the fishing vessels, as well as satellite surveillance.&lt;/p&gt;\n\n&lt;p&gt;Most of the Antarctic region is situated south of 60°S latitude parallel, and is governed in accordance with the international legal regime of the Antarctic Treaty System. The Treaty area covers the continent itself and its immediately adjacent islands, as well as the archipelagos of the South Orkney Islands, South Shetland Islands, Peter I Island, Scott Island and Balleny Islands.&lt;/p&gt;\n\n&lt;p&gt;The islands situated between 60°S latitude parallel to the south and the Antarctic Convergence to the north, and their respective 200-nautical-mile (370 km) exclusive economic zones fall under the national jurisdiction of the countries that possess them: South Georgia and the South Sandwich Islands (United Kingdom; also an EU Overseas territory), Bouvet Island (Norway), and Heard and McDonald Islands (Australia).&lt;/p&gt;\n\n&lt;p&gt;&lt;b&gt;Kerguelen Islands&lt;/b&gt; (France; also an EU Overseas territory) are situated in the Antarctic Convergence area, while the Falkland Islands, Isla de los Estados, Hornos Island with Cape Horn, Diego Ramírez Islands, Campbell Island, Macquarie Island, Amsterdam and Saint Paul Islands, Crozet Islands, Prince Edward Islands, and Gough Island and Tristan da Cunha group remain north of the Convergence and thus outside the Antarctic region.&lt;/p&gt;\n&lt;/div&gt;\n</code></pre>\n\n<hr>\n\n<pre><code>&lt;P&gt;&lt;B&gt;Антарктике&lt;/B&gt; это полярные области вокруг Южного полюса Земли, противоположная Арктике, вокруг Северного полюса. Карта состоит из антарктического материка и островных территорий, расположенных на антарктической плиты. Антарктический регион включает шельфовые ледники, воды и островных территорий в &lt;I&gt;Южный Океан&lt;/I&gt; расположенный к югу от антарктической конвергенции, зона примерно от 32 до 48 км (от 20 до 30 ми) широкий различающихся по широте сезонно. Регион охватывает около 20 процентов из Южного полушария, из которых 5,5 процента (14 млн. км2) площади Антарктического континента. Все земли и шельфовые ледники к югу от 60°южной широты применяются в рамках системы Договора об Антарктике. Биогеографически, экозона в Антарктике является одним из восьми экозонам земельных участков земной поверхности.&lt;/P&gt;\n&lt;H2&gt;География&lt;/H2&gt;\n&lt;DIV&gt;\n&lt;P&gt;В морской части региона является область применения Международной конвенции по сохранению морских живых ресурсов Антарктики (АНТКОМ), где по техническим причинам в Конвенции используется аппроксимация сходимость линии с помощью линии, соединяющей указанные точки вдоль параллелей широты и меридианов долготы. Реализация конвенции осуществляется через международную комиссию со штаб-квартирой в Хобарте, Австралия, с помощью эффективной системы ежегодных квот, лицензий и международных инспекторов на рыболовных судах, а также спутниковое наблюдение.&lt;/P&gt;\n&lt;P&gt;Большинство Антарктический регион расположен к югу от 60°южной широты параллельно, и управляется в соответствии с международно-правовым режимом системы Договора об Антарктике. Области договора распространяется на континенте и прилегающих островах, а также архипелаги Южно-Оркнейские острова, Южные Шетландские острова, остров Петра I, Скотт островов и островов Баллени.&lt;/P&gt;\n&lt;P&gt;Острова, расположенные между 60°ю. ш параллельно Южной и Антарктической конвергенции на север, и их 200-мильной (370 км) исключительной экономической зоны находятся под национальной юрисдикцией стран, которые ими обладают: Южная Георгия и Южные Сандвичевы острова (Великобритания; также ЕС заморская территория), Остров Буве (Норвегия) и Острова Херд и Макдональд (Австралия).&lt;/P&gt;\n&lt;P&gt;&lt;B&gt;Кергелен &lt;/B&gt; (Франция; также ЕС заморская территория) находятся в антарктической конвергенции зона, а Фолклендские острова, Исла де лос Эстадос, Орнос на острове с мыса Горн, Диего-Рамирес острова, Кэмпбелл остров, остров Маккуори, Амстердам и Сен-Поль острова Крозе, Принс-Эдуард острова, и остров Гоф и Тристан-да-Кунья группы остаются Северная сходимости и, следовательно, за пределами Антарктики.&lt;/P&gt;&lt;/DIV&gt;\n</code></pre>\n\n<p>Но недостаток в том, что данный метод генерирует слишком много мелких запросов к API, поэтому перевод большого документа будет длиться очень долго. Кроме того, качество перевода страдает, так как предложения будут дробиться на части и переводиться отдельно. Чтобы улучшить данный способ, необходимо придумать, как агрегировать запросы. Скорее всего, элемент, содержащий только инлайновые подэлементы (b, span и т.п.), нужно переводить как цельный кусок, но как провернуть это, сохранив форматирование, задача довольно сложная.</p>\n"}