{"owner":{"reputation":16137,"user_id":240512,"user_type":"registered","profile_image":"https://i.stack.imgur.com/Ew6lG.png?s=128&g=1","display_name":"MSDN.WhiteKnight","link":"https://ru.stackoverflow.com/users/240512/msdn-whiteknight"},"is_accepted":false,"score":1,"last_activity_date":1541479480,"creation_date":1541479480,"answer_id":902766,"question_id":891521,"body":"<p>Путь к экземпляру устройства - это <a href=\"https://docs.microsoft.com/en-us/windows-hardware/drivers/install/device-instance-ids\" rel=\"nofollow noreferrer\">Device Instance ID</a>, строка, которая уникально идентифицирует экземпляр устройства в системе. Ее содержание определяется драйвером контроллера шины, к которому подключено устройство. Состоит из двух частей: </p>\n\n<ul>\n<li><p>Идентификатора типа устройства. Обычно включает имя шины, код производителя и/или код модели и не зависит от порта подключения.</p></li>\n<li><p>Идентификатор экземпляра устройства (когда к компьютеру подключено два устройства одного типа, идентификатор экземпляра используется, чтобы их различать). В общем случае он является функцией от серийного номера устройства и/или порта подключения.</p></li>\n</ul>\n\n<p>Device Instance ID гарантированно сохраняется при перезагрузках системы (т.е., когда компьютер выключен, а затем включен с тем же устройством на том же порту). Во всех иных случаях, например, при переключении устройства на другой порт или переустановке его драйвера, постоянство Device Instance ID в общем случае не гарантируется.</p>\n\n<hr>\n\n<p>Конкретно для USB-устройств, при использовании стандартного драйвера USB-контроллера: если устройство имеет серийный номер, то ему будет присвоен тот же Instance ID при подключении к другому порту. Если у устройства нет серийного номера или он совпал с серийным номером другого уже подключенного устройства (что может случиться, когда производители не заморачиваются с уникальными номерами, а используют что-то вроде 12345678), то Instance ID будет основан на номере порта и не будет сохраняться при переключении на другой порт. Большинство запоминающих устройств, как правило, имеют серийный номер, а USB-клавиатуры и мыши обычно не имеют. </p>\n\n<p>Следует помнить, что стандартные драйвера для контроллеров USB 3.0 появились только с Windows 8. Поэтому на предыдущих системах для них используются нестандартные драйвера, которые могут иметь другое поведение.</p>\n"}