{"owner":{"reputation":16137,"user_id":240512,"user_type":"registered","profile_image":"https://i.stack.imgur.com/Ew6lG.png?s=128&g=1","display_name":"MSDN.WhiteKnight","link":"https://ru.stackoverflow.com/users/240512/msdn-whiteknight"},"is_accepted":true,"score":1,"last_activity_date":1543553086,"creation_date":1543553086,"answer_id":913477,"question_id":913286,"body":"<p>Механизма защиты отдельной управляемой сборки в .NET не существует. В Windows, однако, существуют другие механизмы защиты памяти.</p>\n\n<ol>\n<li><p>Начиная с Windows 10, <a href=\"https://docs.microsoft.com/en-us/windows/desktop/memory/trusted-execution\" rel=\"nofollow noreferrer\">Trusted execution</a> позволяет создавать изолированные области памяти, так что доступ к данным в такой области может быть получен только кодом, загруженным в эту же область. Требует аппаратной поддержки со стороны процессора (например, Intel Software Guard Extensions).</p></li>\n<li><p>Для антивирусных приложений, начиная с Windows 8.1 существует механизм <a href=\"https://docs.microsoft.com/en-us/windows/desktop/services/protecting-anti-malware-services-\" rel=\"nofollow noreferrer\">защищенных сервисов</a>, который ограничивает доступ к памяти целого процесса. Любые модули, загружаемые в защищенный сервис, должны быть подписаны специальным сертификатом.</p></li>\n<li><p>Приложения для обработки звука или видео, начиная с Windows Vista, могут использовать Windows Media Foundation, который в целях защиты авторских прав также предоставляет похожий функционал (см. <a href=\"https://docs.microsoft.com/en-us/windows/desktop/medfound/protected-media-path\" rel=\"nofollow noreferrer\">Protected Media Path</a>)</p></li>\n<li><p>Когда вышеперечисленное не применимо, приложение может попытаться защитится теми же методами, которыми действует вредоносное ПО: инжекция DLL в во все процессы и перехват вызовов функций работы с памятью (ReadProcessMemory и др.). Антивирусы в старых версиях Windows действуют именно так. Однако, этот метод очень ненадежен, ведь если в системе две программы пытаются применить его одновременно, они входят в конфликт и результат непредсказуем.</p></li>\n</ol>\n\n<p>В общем, если вам нужна реальная защита, как минимум нужно переходить к использованию неуправляемого кода. Также, можно всегда вынести критичный код в удаленный сервис (думаю, это единственный реальный способ защиты, когда секретным является сам код).</p>\n"}