{"owner":{"reputation":2368,"user_id":321467,"user_type":"registered","profile_image":"https://www.gravatar.com/avatar/90b7faf3f379380fe08bb28c365f3246?s=128&d=identicon&r=PG&f=1","display_name":"MGNeo","link":"https://ru.stackoverflow.com/users/321467/mgneo"},"is_accepted":false,"score":2,"last_activity_date":1548218344,"creation_date":1548218344,"answer_id":935494,"question_id":935440,"body":"<p>1) Это зависит от того, имеются ли в библиотеке специфические вызовы и ресурсы. Сказать однозначно, нужен пакет или нет, невозможно. Нужно запустить и посмотреть.</p>\n\n<p>2) Теоретически, библиотеки могут быть собраны в любом окружении, даже на другой операционной системе. Но обычно, если говорят, что проект/библиотека собираются в <code>VS C++ 2008</code>, то так оно и есть.</p>\n\n<p>3) Степень телодвижений для использования библиотеки зависит от того, как именно эта библиотека реализована. Тут нет общего правила. Хорошим тоном считается сокрытие всей библиотечной магии под сишными интерфейсом. Такой подход позволяет выставить наружу простой интерфейс, который может быть использован различными компиляторами и даже другим языковым окружением. Обычно, при использовании сишного интерфейса значение имеет только разрядность используемого вами компилятора - она должна совпадать с разрядностью компилятора, которым библиотека была собрана. </p>\n\n<p>Однако, в мире <code>C++</code> очень часто бывает так, что в интерфейс библиотеки <em>просачиваются</em> тонкости реализации используемого компилятора. В этом случае библиотеку очень тяжело заставить работать, потому что исключения, шаблоны, искажения имен и вот это все - определяется реализацией и может меняться даже при смене настроек компиляции в одном и том же компиляторе.</p>\n\n<p>4) Версия используемого компилятора вам мало чем поможет.</p>\n\n<p>Стандарт C++17 занимает 1700 страниц. Больше половины этого - поведение, определяемое реализацией, то есть - разработчиками компиляторов.</p>\n\n<p>Поэтому, если библиотеку не удается подключить к вашему компилятору, при условии, что компилятор имеет подходящую разрядность, то лучше найти другую библиотеку, которая предоставит классический <code>C</code>-интерфейс.</p>\n"}