{"owner":{"reputation":16058,"user_id":240512,"user_type":"registered","profile_image":"https://i.stack.imgur.com/Ew6lG.png?s=128&g=1","display_name":"MSDN.WhiteKnight","link":"https://ru.stackoverflow.com/users/240512/msdn-whiteknight"},"is_accepted":false,"score":3,"last_activity_date":1550425149,"last_edit_date":1550425149,"creation_date":1549949072,"answer_id":943751,"question_id":934247,"body":"<p>Никто, разумеется, не отказывается от COM и ActiveX. Большая часть современных компонентов Windows, начиная от DirectShow и заканчивая WinRT/UWP, основана именно на COM. Сама идея \"отказа\" от него абсурдна, это означало бы возврат во времена до Windows 95. ActiveX, конечно, сейчас не очень актуален, но от него также никто не отказывается. Например, ActiveX-элемент Windows Media Player вполне работает в IE11:</p>\n\n<pre><code>&lt;object id=\"mediaplayer\" classid=\"clsid:22d6f312-b0f6-11d0-94ab-0080c74c7e95\" codebase=\"http://activex.microsoft.com/activex/controls/mplayer/en/nsmp2inf.cab#version=5,1,52,701\" standby=\"please wait...\" type=\"application/x-oleobject\" width=\"640\" height=\"480\"&gt;\n&lt;param name=\"filename\" value=\"./video.avi\"&gt;\n&lt;/object&gt;\n</code></pre>\n\n<p>В приложениях Windows Forms, по моим тестам, ActiveX-элементы тоже работают. </p>\n\n<p>Другое дело, что сам Internet Explorer, который используется средством просмотра chm, действительно несколько устарел, а современные браузеры уже не поддерживают встраивание ActiveX в HTML. Поэтому я бы сильно не рассчитывал на эту технологию при разработке чего-то серьезного. Если вам нужно встраивать в HTML какой-то сложный функционал, изучайте API для разработки расширений под конкретные браузерные движки.</p>\n\n<p>Что касается вашего chm-файла, я попробовал его открыть, но у меня ничего не работает ни в Windows 10, ни в XP. Кнопки со скрипичным ключом не появляется. Есть кнопка \"download\", которая ведет на страницу 404 системы Ucoz. Если залезть в код, в файле master.js видно, что он пытается создать экземпляр объекта COM-класса с CLSID 8739CB66-6D75-11D4-B8CF-8DD84C2C1547, которого у меня в системе нету. Вероятно, для его работы нужно установить некий \"Thy Active X control\" с вашего сайта, однако ссылка на его скачивание также ведет на страницу 404. В общем, нужно больше информации...</p>\n\n<hr>\n\n<p>По итогам обсуждения в комментариях:</p>\n\n<ol>\n<li><p>Поскольку в 64-разрядных системах 64-разрядный Internet Explorer, на них необходимо развертывать 64-разрядную версию ActiveX-элемента.</p></li>\n<li><p>DLL с ActiveX-элементом не нужно развертывать в системный каталог. Если же по какой-то причине необходимо развертывать именно в системный, убедитесь, что ее не блокирует антивирус и что вы развертываете в правильную папку на x64 ОС: System32 для 64-разрядных DLL, SysWow64 - для 32-разрядных.   </p></li>\n</ol>\n"}