{"owner":{"reputation":16137,"user_id":240512,"user_type":"registered","profile_image":"https://i.stack.imgur.com/Ew6lG.png?s=128&g=1","display_name":"MSDN.WhiteKnight","link":"https://ru.stackoverflow.com/users/240512/msdn-whiteknight"},"is_accepted":false,"score":8,"last_activity_date":1550864236,"last_edit_date":1550864236,"creation_date":1550861309,"answer_id":948204,"question_id":906663,"body":"<blockquote>\n  <p>Получается, методы расширения — это опасная штука?</p>\n</blockquote>\n\n<p>Да, это несомненно так. Методы расширения — грубый хак, нарушающий принципы объектно-ориентированного программирования, и помимо проблемы неконтролируемого скрытия членами расширяемого класса они также страдают от проблемы конфликтов между самими собой (ведь разные библиотеки могут создавать методы расширения для одного класса). Чрезмерно использовать их не стоит. </p>\n\n<p><a href=\"https://docs.microsoft.com/en-us/dotnet/standard/design-guidelines/extension-methods\" rel=\"noreferrer\">Framework Design Guidelines</a> явно не рекомендуют это:</p>\n\n<blockquote>\n  <p><strong>AVOID</strong> frivolously defining extension methods, especially on types you don’t own. </p>\n</blockquote>\n\n<p>Там же упоминают два случая, когда использование методов расширения оправдано:</p>\n\n<ul>\n<li><p>Добавление какого-либо функционала во все типы, реализующие определенный интерфейс. В этом случае опасность несколько ниже, ведь в интерфейсы обычно не добавляют новые методы (так как это требовало бы переписывания кода кучи классов, которые уже реализуют этот интерфейс). Именно таким образом работает LINQ.</p></li>\n<li><p>Методы, завязанные на типы, определенные в вашем собственном коде. Допустим, вы создаете метод расширения к классу <code>String</code>, принимающий аргумент типа <code>Person</code>, определенного в вашем проекте. В этом случае описанного конфликта также не будет, ведь даже если MS добавят новый метод в класс <code>String</code>, он точно никак не будет использовать класс из вашего кода.  </p></li>\n</ul>\n\n<p>К сожалению, следование этим рекомендациям все равно полностью не решает проблемы, так как остаются конфликты между самими методами расширений из разных библиотек. Именно <a href=\"https://github.com/morelinq/MoreLINQ/issues/351\" rel=\"noreferrer\">с этой проблемой</a> столкнулись разработчики библиотеки MoreLinq. </p>\n\n<p>Конечно, Framework Design Guidelines — это рекомендации для разработчиков публичных API библиотек, а не любого кода в приложениях. Но сути это мало меняет, так как нужно стремиться делать любой код пригодным к повторному использованию. Проекты имеют тенденцию расти, разделяться и т.п; какой-то код, который раньше использовался только в одном проекте, впоследствии захочется вынести в общую библиотеку. Поэтому эти рекомендации во многом можно распространить и на код приложений.</p>\n"}